Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024MCF100.atdf
         <interrupt caption="Input Capture 15 Error" index="212" module-instance="INPUT_CAPTURE_15_ERROR" name="INPUT_CAPTURE_15_ERROR" />
         <interrupt caption="Input Capture 15" index="213" module-instance="INPUT_CAPTURE_15" name="INPUT_CAPTURE_15" />
         <interrupt caption="Output Compare 15" index="214" module-instance="OUTPUT_COMPARE_15" name="OUTPUT_COMPARE_15" />
         <interrupt caption="Input Capture 16 Error" index="215" module-instance="INPUT_CAPTURE_16_ERROR" name="INPUT_CAPTURE_16_ERROR" />
         <interrupt caption="Input Capture 16" index="216" module-instance="INPUT_CAPTURE_16" name="INPUT_CAPTURE_16" />
         <interrupt caption="Output Compare 16" index="217" module-instance="OUTPUT_COMPARE_16" name="OUTPUT_COMPARE_16" />
         <interrupt caption="SPI3 Fault" index="218" module-instance="SPI3_FAULT" name="SPI3_FAULT" />
         <interrupt caption="SPI3 Receive Done" index="219" module-instance="SPI3_RX" name="SPI3_RX" />
         <interrupt caption="SPI3 Transfer Done" index="220" module-instance="SPI3_TX" name="SPI3_TX" />
         <interrupt caption="SPI4 Fault" index="221" module-instance="SPI4_FAULT" name="SPI4_FAULT" />
         <interrupt caption="SPI4 Receive Done" index="222" module-instance="SPI4_RX" name="SPI4_RX" />
         <interrupt caption="SPI4 Transfer Done" index="223" module-instance="SPI4_TX" name="SPI4_TX" />
         <interrupt caption="SPI5 Fault" index="224" module-instance="SPI5_FAULT" name="SPI5_FAULT" />
         <interrupt caption="SPI5 Receive Done" index="225" module-instance="SPI5_RX" name="SPI5_RX" />
         <interrupt caption="SPI5 Transfer Done" index="226" module-instance="SPI5_TX" name="SPI5_TX" />
         <interrupt caption="SPI6 Fault" index="227" module-instance="SPI6_FAULT" name="SPI6_FAULT" />
         <interrupt caption="SPI6 Receive Done" index="228" module-instance="SPI6_RX" name="SPI6_RX" />
         <interrupt caption="SPI6 Transfer Done" index="229" module-instance="SPI6_TX" name="SPI6_TX" />
         <interrupt caption="System Bus Protection Violation" index="230" module-instance="SYSTEM_BUS_PROTECTION" name="SYSTEM_BUS_PROTECTION" />
         <interrupt caption="PWM 7 Interrupt" index="238" module-instance="PWM7" name="PWM7" />
         <interrupt caption="PWM 8 Interrupt" index="239" module-instance="PWM8" name="PWM8" />
         <interrupt caption="PWM 9 Interrupt" index="240" module-instance="PWM9" name="PWM9" />
         <interrupt caption="PWM 10 Interrupt" index="241" module-instance="PWM10" name="PWM10" />
         <interrupt caption="PWM 11 Interrupt" index="242" module-instance="PWM11" name="PWM11" />
         <interrupt caption="PWM 12 Interrupt" index="243" module-instance="PWM12" name="PWM12" />
         <interrupt caption="USB2 Combined Interrupt" index="244" module-instance="USB_2" name="USB_2" />
         <interrupt caption="ADC Digital Comparator 3" index="245" module-instance="ADC_DC3" name="ADC_DC3" />
         <interrupt caption="ADC Digital Comparator 4" index="246" module-instance="ADC_DC4" name="ADC_DC4" />
         <interrupt caption="MPU Core Performance Counter Event" index="254" module-instance="CORE_PERF_COUNT" name="CORE_PERF_COUNT" />
         <interrupt caption="Core Fast Debug Channel" index="255" module-instance="CORE_FAST_DEBUG_CHAN" name="CORE_FAST_DEBUG_CHAN" />
      </interrupts>
      <interfaces>
         <interface name="JTAG" type="samjtag" />
         <interface name="SWD" type="swd" />
      </interfaces>
   </device>
</devices>
<modules>
   <module caption="" id="" name="FUSECONFIG" version="">
      <register-group name="FUSECONFIG">
         <register caption="Device Configuration Word 3" name="DEVCFG3" initval="0xFFFFFFFF">
            <bitfield caption="UserID" mask="0xffff" name="USERID" values="DEVCFG3__USERID" />
            <bitfield caption="PWM Write Access Select bit" mask="0x100000" name="PWMLOCK" values="DEVCFG3__PWMLOCK" />
            <bitfield caption="USB2 USBID Selection bit" mask="0x400000" name="FUSBIDIO2" values="DEVCFG3__FUSBIDIO2" />
            <bitfield caption="USB2 VBUSON Selection bit" mask="0x800000" name="FVBUSIO2" values="DEVCFG3__FVBUSIO2" />
            <bitfield caption="Permission Group Lock One Way Configuration bit" mask="0x8000000" name="PGL1WAY" values="DEVCFG3__PGL1WAY" />
            <bitfield caption="Peripheral Module Disable Configuration bit" mask="0x10000000" name="PMDL1WAY" values="DEVCFG3__PMDL1WAY" />
            <bitfield caption="Peripheral Pin Select Configuration bit" mask="0x20000000" name="IOL1WAY" values="DEVCFG3__IOL1WAY" />
            <bitfield caption="USB1 USBID Selection bit" mask="0x40000000" name="FUSBIDIO1" values="DEVCFG3__FUSBIDIO1" />
            <bitfield caption="USB1 VBUSON Selection bit" mask="0x80000000" name="FVBUSIO1" values="DEVCFG3__FVBUSIO1" />
         </register>
         <register caption="Device Configuration Word 2" name="DEVCFG2" initval="0xF7FAA728">
            <bitfield caption="PLL Input Divider bits" mask="0x7" name="FPLLIDIV" values="DEVCFG2__FPLLIDIV" />
            <bitfield caption="System PLL Divided Input Clock Frequency Range bits" mask="0x70" name="FPLLRNG" values="DEVCFG2__FPLLRNG" />
            <bitfield caption="System PLL Input Clock Select bit" mask="0x80" name="FPLLICLK" values="DEVCFG2__FPLLICLK" />
            <bitfield caption="System PLL Feedback Divider bits" mask="0x7f00" name="FPLLMULT" values="DEVCFG2__FPLLMULT" />
            <bitfield caption="Default System PLL Output Divisor bits" mask="0x70000" name="FPLLODIV" values="DEVCFG2__FPLLODIV" />
            <bitfield caption="VBAT BOR Enable bit" mask="0x80000" name="VBATBOREN" values="DEVCFG2__VBATBOREN" />
            <bitfield caption="Deep Sleep BOR Enable bit" mask="0x100000" name="DSBOREN" values="DEVCFG2__DSBOREN" />
            <bitfield caption="Deep Sleep Watchdog Timer Postscale Select bits" mask="0x3e00000" name="DSWDTPS" values="DEVCFG2__DSWDTPS" />
            <bitfield caption="Deep Sleep Watchdog Timer Reference Clock Select bit" mask="0x4000000" name="DSWDTOSC" values="DEVCFG2__DSWDTOSC" />
            <bitfield caption="Deep Sleep Watchdog Timer Enable bit" mask="0x8000000" name="DSWDTEN" values="DEVCFG2__DSWDTEN" />
            <bitfield caption="Deep Sleep Enable bit" mask="0x10000000" name="FDSEN" values="DEVCFG2__FDSEN" />
            <bitfield caption="Brown-out Reset Select Trip Voltage bit" mask="0x20000000" name="BORSEL" values="DEVCFG2__BORSEL" />
            <bitfield caption="USB PLL Enable bit" mask="0x80000000" name="UPLLEN" values="DEVCFG2__UPLLEN" />
         </register>
         <register caption="Device Configuration Word 1" name="DEVCFG1" initval="0x5F74FCF9">
            <bitfield caption="Oscillator Selection bits" mask="0x7" name="FNOSC" values="DEVCFG1__FNOSC" />
            <bitfield caption="Deadman Timer Count Window Interval bits" mask="0x38" name="DMTINTV" values="DEVCFG1__DMTINTV" />
            <bitfield caption="Secondary Oscillator Enable bit" mask="0x40" name="FSOSCEN" values="DEVCFG1__FSOSCEN" />
            <bitfield caption="Internal External Switchover bit" mask="0x80" name="IESO" values="DEVCFG1__IESO" />
            <bitfield caption="Primary Oscillator Configuration bits" mask="0x300" name="POSCMOD" values="DEVCFG1__POSCMOD" />
            <bitfield caption="CLKO Enable Configuration bit" mask="0x400" name="OSCIOFNC" values="DEVCFG1__OSCIOFNC" />
            <bitfield caption="Clock Switching and Monitoring Selection Configuration bits" mask="0xc000" name="FCKSM" values="DEVCFG1__FCKSM" />
            <bitfield caption="Watchdog Timer Postscale Select bits" mask="0x1f0000" name="WDTPS" values="DEVCFG1__WDTPS" />
            <bitfield caption="Watchdog Timer Stop During Flash Programming bit" mask="0x200000" name="WDTSPGM" values="DEVCFG1__WDTSPGM" />
            <bitfield caption="Watchdog Timer Window Enable bit" mask="0x400000" name="WINDIS" values="DEVCFG1__WINDIS" />
            <bitfield caption="Watchdog Timer Enable bit" mask="0x800000" name="FWDTEN" values="DEVCFG1__FWDTEN" />
            <bitfield caption="Watchdog Timer Window Size bits" mask="0x3000000" name="FWDTWINSZ" values="DEVCFG1__FWDTWINSZ" />
            <bitfield caption="Deadman Timer Count Select bits" mask="0x7c000000" name="DMTCNT" values="DEVCFG1__DMTCNT" />
            <bitfield caption="Deadman Timer enable bit" mask="0x80000000" name="FDMTEN" values="DEVCFG1__FDMTEN" />
         </register>
