Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024MCF100.atdf
         <register caption="ADC Global Interrupt Enable Register 2" name="ADCGIRQEN2" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x00000001" name="AGIEN32" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00000002" name="AGIEN33" values="ADCGIRQEN2__AGIEN33" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00000004" name="AGIEN34" values="ADCGIRQEN2__AGIEN34" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00000008" name="AGIEN35" values="ADCGIRQEN2__AGIEN35" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00000010" name="AGIEN36" values="ADCGIRQEN2__AGIEN36" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00000020" name="AGIEN37" values="ADCGIRQEN2__AGIEN37" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00000040" name="AGIEN38" values="ADCGIRQEN2__AGIEN38" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00000080" name="AGIEN39" values="ADCGIRQEN2__AGIEN39" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00000100" name="AGIEN40" values="ADCGIRQEN2__AGIEN40" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00000200" name="AGIEN41" values="ADCGIRQEN2__AGIEN41" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00002000" name="AGIEN45" values="ADCGIRQEN2__AGIEN45" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00004000" name="AGIEN46" values="ADCGIRQEN2__AGIEN46" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00008000" name="AGIEN47" values="ADCGIRQEN2__AGIEN47" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00010000" name="AGIEN48" values="ADCGIRQEN2__AGIEN48" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00020000" name="AGIEN49" values="ADCGIRQEN2__AGIEN49" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00040000" name="AGIEN50" values="ADCGIRQEN2__AGIEN50" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00080000" name="AGIEN51" values="ADCGIRQEN2__AGIEN51" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00100000" name="AGIEN52" values="ADCGIRQEN2__AGIEN52" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00200000" name="AGIEN53" values="ADCGIRQEN2__AGIEN53" />
         </register>
         <register caption="ADC Common Scan Select Register 1" name="ADCCSS1" offset="0xa0" rw="RW" size="4">
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000001" name="CSS0" values="ADCCSS1__CSS0" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000002" name="CSS1" values="ADCCSS1__CSS1" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000004" name="CSS2" values="ADCCSS1__CSS2" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000008" name="CSS3" values="ADCCSS1__CSS3" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000010" name="CSS4" values="ADCCSS1__CSS4" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000020" name="CSS5" values="ADCCSS1__CSS5" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000040" name="CSS6" values="ADCCSS1__CSS6" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000080" name="CSS7" values="ADCCSS1__CSS7" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000100" name="CSS8" values="ADCCSS1__CSS8" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000200" name="CSS9" values="ADCCSS1__CSS9" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000400" name="CSS10" values="ADCCSS1__CSS10" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000800" name="CSS11" values="ADCCSS1__CSS11" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00001000" name="CSS12" values="ADCCSS1__CSS12" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00002000" name="CSS13" values="ADCCSS1__CSS13" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00004000" name="CSS14" values="ADCCSS1__CSS14" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00008000" name="CSS15" values="ADCCSS1__CSS15" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00010000" name="CSS16" values="ADCCSS1__CSS16" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00020000" name="CSS17" values="ADCCSS1__CSS17" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00040000" name="CSS18" values="ADCCSS1__CSS18" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00080000" name="CSS19" values="ADCCSS1__CSS19" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00100000" name="CSS20" values="ADCCSS1__CSS20" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00200000" name="CSS21" values="ADCCSS1__CSS21" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00400000" name="CSS22" values="ADCCSS1__CSS22" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00800000" name="CSS23" values="ADCCSS1__CSS23" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x01000000" name="CSS24" values="ADCCSS1__CSS24" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x02000000" name="CSS25" values="ADCCSS1__CSS25" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x04000000" name="CSS26" values="ADCCSS1__CSS26" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x08000000" name="CSS27" values="ADCCSS1__CSS27" />
         </register>
         <register caption="ADC Common Scan Select Register 2" name="ADCCSS2" offset="0xb0" rw="RW" size="4">
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000002" name="CSS33" values="ADCCSS2__CSS33" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000004" name="CSS34" values="ADCCSS2__CSS34" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000008" name="CSS35" values="ADCCSS2__CSS35" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000010" name="CSS36" values="ADCCSS2__CSS36" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000020" name="CSS37" values="ADCCSS2__CSS37" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000040" name="CSS38" values="ADCCSS2__CSS38" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000080" name="CSS39" values="ADCCSS2__CSS39" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000100" name="CSS40" values="ADCCSS2__CSS40" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000200" name="CSS41" values="ADCCSS2__CSS41" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00002000" name="CSS45" values="ADCCSS2__CSS45" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00004000" name="CSS46" values="ADCCSS2__CSS46" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00008000" name="CSS47" values="ADCCSS2__CSS47" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00010000" name="CSS48" values="ADCCSS2__CSS48" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00020000" name="CSS49" values="ADCCSS2__CSS49" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00040000" name="CSS50" values="ADCCSS2__CSS50" />
            <bitfield mask="0x00080000" name="CSS51" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00100000" name="CSS52" values="ADCCSS2__CSS52" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00200000" name="CSS53" values="ADCCSS2__CSS53" />
         </register>
