Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024MCF100.atdf
         <register caption="ADC Data Ready Status Register 1" name="ADCDSTAT1" offset="0xc0" rw="R" size="4">
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000001" name="ARDY0" values="ADCDSTAT1__ARDY0" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000002" name="ARDY1" values="ADCDSTAT1__ARDY1" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000004" name="ARDY2" values="ADCDSTAT1__ARDY2" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000008" name="ARDY3" values="ADCDSTAT1__ARDY3" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000010" name="ARDY4" values="ADCDSTAT1__ARDY4" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000020" name="ARDY5" values="ADCDSTAT1__ARDY5" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000040" name="ARDY6" values="ADCDSTAT1__ARDY6" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000080" name="ARDY7" values="ADCDSTAT1__ARDY7" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000100" name="ARDY8" values="ADCDSTAT1__ARDY8" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000200" name="ARDY9" values="ADCDSTAT1__ARDY9" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000400" name="ARDY10" values="ADCDSTAT1__ARDY10" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000800" name="ARDY11" values="ADCDSTAT1__ARDY11" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00001000" name="ARDY12" values="ADCDSTAT1__ARDY12" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00002000" name="ARDY13" values="ADCDSTAT1__ARDY13" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00004000" name="ARDY14" values="ADCDSTAT1__ARDY14" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00008000" name="ARDY15" values="ADCDSTAT1__ARDY15" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00010000" name="ARDY16" values="ADCDSTAT1__ARDY16" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00020000" name="ARDY17" values="ADCDSTAT1__ARDY17" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00040000" name="ARDY18" values="ADCDSTAT1__ARDY18" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00080000" name="ARDY19" values="ADCDSTAT1__ARDY19" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00100000" name="ARDY20" values="ADCDSTAT1__ARDY20" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00200000" name="ARDY21" values="ADCDSTAT1__ARDY21" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00400000" name="ARDY22" values="ADCDSTAT1__ARDY22" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00800000" name="ARDY23" values="ADCDSTAT1__ARDY23" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x01000000" name="ARDY24" values="ADCDSTAT1__ARDY24" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x02000000" name="ARDY25" values="ADCDSTAT1__ARDY25" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x04000000" name="ARDY26" values="ADCDSTAT1__ARDY26" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x08000000" name="ARDY27" values="ADCDSTAT1__ARDY27" />
         </register>
         <register caption="ADC Data Ready Status Register 2" name="ADCDSTAT2" offset="0xd0" rw="R" size="4">
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000002" name="ARDY33" values="ADCDSTAT2__ARDY33" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000004" name="ARDY34" values="ADCDSTAT2__ARDY34" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000008" name="ARDY35" values="ADCDSTAT2__ARDY35" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000010" name="ARDY36" values="ADCDSTAT2__ARDY36" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000020" name="ARDY37" values="ADCDSTAT2__ARDY37" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000040" name="ARDY38" values="ADCDSTAT2__ARDY38" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000080" name="ARDY39" values="ADCDSTAT2__ARDY39" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000100" name="ARDY40" values="ADCDSTAT2__ARDY40" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000200" name="ARDY41" values="ADCDSTAT2__ARDY41" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00002000" name="ARDY45" values="ADCDSTAT2__ARDY45" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00004000" name="ARDY46" values="ADCDSTAT2__ARDY46" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00008000" name="ARDY47" values="ADCDSTAT2__ARDY47" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00010000" name="ARDY48" values="ADCDSTAT2__ARDY48" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00020000" name="ARDY49" values="ADCDSTAT2__ARDY49" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00040000" name="ARDY50" values="ADCDSTAT2__ARDY50" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00080000" name="ARDY51" values="ADCDSTAT2__ARDY51" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00100000" name="ARDY52" values="ADCDSTAT2__ARDY52" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00200000" name="ARDY53" values="ADCDSTAT2__ARDY53" />
         </register>
         <register caption="ADC Digital Comparator 'x' Enable Register ('x' = 1 through 4)" name="ADCCMPEN1" offset="0xe0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CMPE0" />
            <bitfield mask="0x00000002" name="CMPE1" />
            <bitfield mask="0x00000004" name="CMPE2" />
            <bitfield mask="0x00000008" name="CMPE3" />
            <bitfield mask="0x00000010" name="CMPE4" />
            <bitfield mask="0x00000020" name="CMPE5" />
            <bitfield mask="0x00000040" name="CMPE6" />
            <bitfield mask="0x00000080" name="CMPE7" />
            <bitfield mask="0x00000100" name="CMPE8" />
            <bitfield mask="0x00000200" name="CMPE9" />
            <bitfield mask="0x00000400" name="CMPE10" />
            <bitfield mask="0x00000800" name="CMPE11" />
            <bitfield mask="0x00001000" name="CMPE12" />
            <bitfield mask="0x00002000" name="CMPE13" />
            <bitfield mask="0x00004000" name="CMPE14" />
            <bitfield mask="0x00008000" name="CMPE15" />
            <bitfield mask="0x00010000" name="CMPE16" />
            <bitfield mask="0x00020000" name="CMPE17" />
            <bitfield mask="0x00040000" name="CMPE18" />
            <bitfield mask="0x00080000" name="CMPE19" />
            <bitfield mask="0x00100000" name="CMPE20" />
            <bitfield mask="0x00200000" name="CMPE21" />
            <bitfield mask="0x00400000" name="CMPE22" />
            <bitfield mask="0x00800000" name="CMPE23" />
            <bitfield mask="0x01000000" name="CMPE24" />
            <bitfield mask="0x02000000" name="CMPE25" />
            <bitfield mask="0x04000000" name="CMPE26" />
            <bitfield mask="0x08000000" name="CMPE27" />
         </register>
         <register caption="ADC Digital Comparator 'x' Enable Register ('x' = 1 through 4)" name="ADCCMPEN2" offset="0x100" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CMPE0" />
            <bitfield mask="0x00000002" name="CMPE1" />
            <bitfield mask="0x00000004" name="CMPE2" />
            <bitfield mask="0x00000008" name="CMPE3" />
            <bitfield mask="0x00000010" name="CMPE4" />
            <bitfield mask="0x00000020" name="CMPE5" />
            <bitfield mask="0x00000040" name="CMPE6" />
            <bitfield mask="0x00000080" name="CMPE7" />
            <bitfield mask="0x00000100" name="CMPE8" />
            <bitfield mask="0x00000200" name="CMPE9" />
            <bitfield mask="0x00000400" name="CMPE10" />
            <bitfield mask="0x00000800" name="CMPE11" />
            <bitfield mask="0x00001000" name="CMPE12" />
            <bitfield mask="0x00002000" name="CMPE13" />
            <bitfield mask="0x00004000" name="CMPE14" />
            <bitfield mask="0x00008000" name="CMPE15" />
            <bitfield mask="0x00010000" name="CMPE16" />
            <bitfield mask="0x00020000" name="CMPE17" />
            <bitfield mask="0x00040000" name="CMPE18" />
            <bitfield mask="0x00080000" name="CMPE19" />
            <bitfield mask="0x00100000" name="CMPE20" />
            <bitfield mask="0x00200000" name="CMPE21" />
            <bitfield mask="0x00400000" name="CMPE22" />
            <bitfield mask="0x00800000" name="CMPE23" />
            <bitfield mask="0x01000000" name="CMPE24" />
            <bitfield mask="0x02000000" name="CMPE25" />
            <bitfield mask="0x04000000" name="CMPE26" />
            <bitfield mask="0x08000000" name="CMPE27" />
         </register>
         <register caption="ADC Digital Comparator 'x' Enable Register ('x' = 1 through 4)" name="ADCCMPEN3" offset="0x120" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CMPE0" />
            <bitfield mask="0x00000002" name="CMPE1" />
            <bitfield mask="0x00000004" name="CMPE2" />
            <bitfield mask="0x00000008" name="CMPE3" />
            <bitfield mask="0x00000010" name="CMPE4" />
            <bitfield mask="0x00000020" name="CMPE5" />
            <bitfield mask="0x00000040" name="CMPE6" />
            <bitfield mask="0x00000080" name="CMPE7" />
            <bitfield mask="0x00000100" name="CMPE8" />
            <bitfield mask="0x00000200" name="CMPE9" />
            <bitfield mask="0x00000400" name="CMPE10" />
            <bitfield mask="0x00000800" name="CMPE11" />
            <bitfield mask="0x00001000" name="CMPE12" />
            <bitfield mask="0x00002000" name="CMPE13" />
            <bitfield mask="0x00004000" name="CMPE14" />
            <bitfield mask="0x00008000" name="CMPE15" />
            <bitfield mask="0x00010000" name="CMPE16" />
            <bitfield mask="0x00020000" name="CMPE17" />
            <bitfield mask="0x00040000" name="CMPE18" />
            <bitfield mask="0x00080000" name="CMPE19" />
            <bitfield mask="0x00100000" name="CMPE20" />
            <bitfield mask="0x00200000" name="CMPE21" />
            <bitfield mask="0x00400000" name="CMPE22" />
            <bitfield mask="0x00800000" name="CMPE23" />
            <bitfield mask="0x01000000" name="CMPE24" />
            <bitfield mask="0x02000000" name="CMPE25" />
            <bitfield mask="0x04000000" name="CMPE26" />
            <bitfield mask="0x08000000" name="CMPE27" />
         </register>
         <register caption="ADC Digital Comparator 'x' Enable Register ('x' = 1 through 4)" name="ADCCMPEN4" offset="0x140" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CMPE0" />
            <bitfield mask="0x00000002" name="CMPE1" />
            <bitfield mask="0x00000004" name="CMPE2" />
            <bitfield mask="0x00000008" name="CMPE3" />
            <bitfield mask="0x00000010" name="CMPE4" />
            <bitfield mask="0x00000020" name="CMPE5" />
            <bitfield mask="0x00000040" name="CMPE6" />
            <bitfield mask="0x00000080" name="CMPE7" />
            <bitfield mask="0x00000100" name="CMPE8" />
            <bitfield mask="0x00000200" name="CMPE9" />
            <bitfield mask="0x00000400" name="CMPE10" />
            <bitfield mask="0x00000800" name="CMPE11" />
            <bitfield mask="0x00001000" name="CMPE12" />
            <bitfield mask="0x00002000" name="CMPE13" />
            <bitfield mask="0x00004000" name="CMPE14" />
            <bitfield mask="0x00008000" name="CMPE15" />
            <bitfield mask="0x00010000" name="CMPE16" />
            <bitfield mask="0x00020000" name="CMPE17" />
            <bitfield mask="0x00040000" name="CMPE18" />
            <bitfield mask="0x00080000" name="CMPE19" />
            <bitfield mask="0x00100000" name="CMPE20" />
            <bitfield mask="0x00200000" name="CMPE21" />
            <bitfield mask="0x00400000" name="CMPE22" />
            <bitfield mask="0x00800000" name="CMPE23" />
            <bitfield mask="0x01000000" name="CMPE24" />
            <bitfield mask="0x02000000" name="CMPE25" />
            <bitfield mask="0x04000000" name="CMPE26" />
            <bitfield mask="0x08000000" name="CMPE27" />
         </register>
         <register caption="ADC Digital Comparator 'x' Limit Value Register ('x' = 1 through 4)" name="ADCCMP1" offset="0xf0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="DCMPLO" />
            <bitfield mask="0xFFFF0000" name="DCMPHI" />
         </register>
         <register caption="ADC Digital Comparator 'x' Limit Value Register ('x' = 1 through 4)" name="ADCCMP2" offset="0x110" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="DCMPLO" />
            <bitfield mask="0xFFFF0000" name="DCMPHI" />
         </register>
         <register caption="ADC Digital Comparator 'x' Limit Value Register ('x' = 1 through 4)" name="ADCCMP3" offset="0x130" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="DCMPLO" />
            <bitfield mask="0xFFFF0000" name="DCMPHI" />
         </register>
         <register caption="ADC Digital Comparator 'x' Limit Value Register ('x' = 1 through 4)" name="ADCCMP4" offset="0x150" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="DCMPLO" />
            <bitfield mask="0xFFFF0000" name="DCMPHI" />
         </register>
         <register caption="ADC Digital Filter 'x' Register ('x' = 1 through 6)" name="ADCFLTR1" offset="0x1a0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="FLTRDATA" />
            <bitfield caption="Digital Filter Analog Input Selection bits" mask="0x001F0000" name="CHNLID" values="ADCFLTR1__CHNLID" />
            <bitfield caption="Digital Filter 'x' Data Ready Status bit" mask="0x01000000" name="AFRDY" values="ADCFLTR1__AFRDY" />
            <bitfield caption="Digital Filter 'x' Interrupt Enable bit" mask="0x02000000" name="AFGIEN" values="ADCFLTR1__AFGIEN" />
            <bitfield caption="Oversampling Filter Ratio bits" mask="0x1C000000" name="OVRSAM" values="ADCFLTR1__OVRSAM" />
            <bitfield caption="ADC Filter Mode bit" mask="0x20000000" name="DFMODE" values="ADCFLTR1__DFMODE" />
            <bitfield caption="Filter Significant Data Length bit" mask="0x40000000" name="DATA16EN" values="ADCFLTR1__DATA16EN" />
            <bitfield caption="Digital Filter 'x' Enable bit" mask="0x80000000" name="AFEN" values="ADCFLTR1__AFEN" />
         </register>
         <register caption="ADC Digital Filter 'x' Register ('x' = 1 through 6)" name="ADCFLTR2" offset="0x1b0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="FLTRDATA" />
            <bitfield caption="Digital Filter Analog Input Selection bits" mask="0x001F0000" name="CHNLID" values="ADCFLTR2__CHNLID" />
            <bitfield caption="Digital Filter 'x' Data Ready Status bit" mask="0x01000000" name="AFRDY" values="ADCFLTR2__AFRDY" />
            <bitfield caption="Digital Filter 'x' Interrupt Enable bit" mask="0x02000000" name="AFGIEN" values="ADCFLTR2__AFGIEN" />
            <bitfield caption="Oversampling Filter Ratio bits" mask="0x1C000000" name="OVRSAM" values="ADCFLTR2__OVRSAM" />
            <bitfield caption="ADC Filter Mode bit" mask="0x20000000" name="DFMODE" values="ADCFLTR2__DFMODE" />
            <bitfield caption="Filter Significant Data Length bit" mask="0x40000000" name="DATA16EN" values="ADCFLTR2__DATA16EN" />
            <bitfield caption="Digital Filter 'x' Enable bit" mask="0x80000000" name="AFEN" values="ADCFLTR2__AFEN" />
         </register>
         <register caption="ADC Digital Filter 'x' Register ('x' = 1 through 6)" name="ADCFLTR3" offset="0x1c0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="FLTRDATA" />
            <bitfield caption="Digital Filter Analog Input Selection bits" mask="0x001F0000" name="CHNLID" values="ADCFLTR3__CHNLID" />
            <bitfield caption="Digital Filter 'x' Data Ready Status bit" mask="0x01000000" name="AFRDY" values="ADCFLTR3__AFRDY" />
            <bitfield caption="Digital Filter 'x' Interrupt Enable bit" mask="0x02000000" name="AFGIEN" values="ADCFLTR3__AFGIEN" />
            <bitfield caption="Oversampling Filter Ratio bits" mask="0x1C000000" name="OVRSAM" values="ADCFLTR3__OVRSAM" />
            <bitfield caption="ADC Filter Mode bit" mask="0x20000000" name="DFMODE" values="ADCFLTR3__DFMODE" />
            <bitfield caption="Filter Significant Data Length bit" mask="0x40000000" name="DATA16EN" values="ADCFLTR3__DATA16EN" />
            <bitfield caption="Digital Filter 'x' Enable bit" mask="0x80000000" name="AFEN" values="ADCFLTR3__AFEN" />
         </register>
         <register caption="ADC Digital Filter 'x' Register ('x' = 1 through 6)" name="ADCFLTR4" offset="0x1d0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="FLTRDATA" />
            <bitfield caption="Digital Filter Analog Input Selection bits" mask="0x001F0000" name="CHNLID" values="ADCFLTR4__CHNLID" />
            <bitfield caption="Digital Filter 'x' Data Ready Status bit" mask="0x01000000" name="AFRDY" values="ADCFLTR4__AFRDY" />
            <bitfield caption="Digital Filter 'x' Interrupt Enable bit" mask="0x02000000" name="AFGIEN" values="ADCFLTR4__AFGIEN" />
            <bitfield caption="Oversampling Filter Ratio bits" mask="0x1C000000" name="OVRSAM" values="ADCFLTR4__OVRSAM" />
            <bitfield caption="ADC Filter Mode bit" mask="0x20000000" name="DFMODE" values="ADCFLTR4__DFMODE" />
            <bitfield caption="Filter Significant Data Length bit" mask="0x40000000" name="DATA16EN" values="ADCFLTR4__DATA16EN" />
            <bitfield caption="Digital Filter 'x' Enable bit" mask="0x80000000" name="AFEN" values="ADCFLTR4__AFEN" />
         </register>
         <register caption="ADC Trigger Source 1 Register" name="ADCTRG1" offset="0x200" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="TRGSRC0" />
            <bitfield mask="0x00001F00" name="TRGSRC1" />
            <bitfield mask="0x001F0000" name="TRGSRC2" />
            <bitfield caption="Trigger Source for Conversion of ADC3 Module Select bits" mask="0x1F000000" name="TRGSRC3" values="ADCTRG1__TRGSRC3" />
         </register>
         <register caption="ADC Trigger Source 2 Register" name="ADCTRG2" offset="0x210" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="TRGSRC4" />
            <bitfield mask="0x00001F00" name="TRGSRC5" />
            <bitfield mask="0x001F0000" name="TRGSRC6" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN7 Select bits" mask="0x1F000000" name="TRGSRC7" values="ADCTRG2__TRGSRC7" />
         </register>
         <register caption="ADC Trigger Source 3 Register" name="ADCTRG3" offset="0x220" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="TRGSRC8" />
            <bitfield mask="0x00001F00" name="TRGSRC9" />
            <bitfield mask="0x001F0000" name="TRGSRC10" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN11 Select bits" mask="0x1F000000" name="TRGSRC11" values="ADCTRG3__TRGSRC11" />
         </register>
