Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024MCF100.atdf
         <register caption="ADC Output Data Register 'x'" name="ADCDATA18" offset="0x720" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA19" offset="0x730" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA20" offset="0x740" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA21" offset="0x750" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA22" offset="0x760" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA23" offset="0x770" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA24" offset="0x780" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA25" offset="0x790" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA26" offset="0x7a0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA27" offset="0x7b0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA33" offset="0x810" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA34" offset="0x820" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA35" offset="0x830" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA36" offset="0x840" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA37" offset="0x850" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA38" offset="0x860" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA39" offset="0x870" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA40" offset="0x880" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA41" offset="0x890" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA45" offset="0x8d0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA46" offset="0x8e0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA47" offset="0x8f0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA48" offset="0x900" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA49" offset="0x910" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA50" offset="0x920" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA52" offset="0x940" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA53" offset="0x950" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
      </register-group>
      <value-group caption="DMA to System RAM Buffer Length Size bits" name="ADCCON1__DMABL">
         <value caption="Allocates 128 locations in system memory to each analog input" name="" value="0x7" />
         <value caption="Allocates 64 locations in system memory to each analog input" name="" value="0x6" />
         <value caption="Allocates 32 locations in system memory to each analog input" name="" value="0x5" />
         <value caption="Allocates 16 locations in system memory to each analog input" name="" value="0x4" />
         <value caption="Allocates 8 locations in system memory to each analog input" name="" value="0x3" />
         <value caption="Allocates 4 locations in system memory to each analog input" name="" value="0x2" />
         <value caption="Allocates 2 locations in system memory to each analog input" name="" value="0x1" />
         <value caption="Allocates 1 location in system memory to each analog input" name="" value="0x0" />
      </value-group>
      <value-group caption="Scan Trigger High Level/Positive Edge Sensitivity bit" name="ADCCON1__STRGLVL">
         <value caption="Scan trigger is high level sensitive. Once STRIG mode is selected the scan trigger will continue for all selected analog inputs" name="" value="0x1" />
         <value caption="Scan trigger is positive edge sensitive. Once STRIG mode is selected only a single scan trigger will be generated which will complete the scan of all selected analog inputs. (TRGSRCx in the ADCTRGx register)" name="" value="0x0" />
      </value-group>
