Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024MCF100.atdf
      <value-group caption="Flash Control Permission Group bits" name="CFGPG__FCPG">
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;3&gt; = 1" name="" value="0x3" />
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;2&gt; = 1" name="" value="0x2" />
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;1&gt; = 1" name="" value="0x1" />
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;0&gt; = 1" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Permission bits" name="CFGPG__ADCPG">
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;3&gt; = 1" name="" value="0x3" />
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;2&gt; = 1" name="" value="0x2" />
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;1&gt; = 1" name="" value="0x1" />
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;0&gt; = 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Op amp 1 to PGA Mode bit" name="CFGCON2__ENPGA1">
         <value caption="Op amp enable 1x gain mode" name="" value="0x1" />
         <value caption="Op amp 3-terminal standard operation (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Op amp 2 to PGA Mode bit" name="CFGCON2__ENPGA2">
         <value caption="Op amp enable 1x gain mode" name="" value="0x1" />
         <value caption="Op amp 3-terminal standard operation (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Op amp 3 to PGA Mode bit" name="CFGCON2__ENPGA3">
         <value caption="Op amp enable 1x gain mode" name="" value="0x1" />
         <value caption="Op amp 3-terminal standard operation (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Op amp 5 to PGA Mode bit" name="CFGCON2__ENPGA5">
         <value caption="Op amp enable 1x gain mode" name="" value="0x1" />
         <value caption="Op amp 3-terminal standard operation (default)" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01427" name="CMP" version="">
      <register-group name="CMP">
         <register caption="Op amp/Comparator Status Register" name="CMSTAT" offset="0x0" rw="RW" size="4">
            <bitfield caption="Op amp/Comparator 1 Output Status bit" mask="0x00000001" name="C1OUT" values="CMSTAT__C1OUT" />
            <bitfield caption="Op amp/Comparator 2 Output Status bit" mask="0x00000002" name="C2OUT" values="CMSTAT__C2OUT" />
            <bitfield caption="Op amp/Comparator 3 Output Status bit" mask="0x00000004" name="C3OUT" values="CMSTAT__C3OUT" />
            <bitfield caption="Op amp/Comparator 4 Output Status bit" mask="0x00000008" name="C4OUT" values="CMSTAT__C4OUT" />
            <bitfield caption="Op amp/Comparator 5 Output Status bit" mask="0x00000010" name="C5OUT" values="CMSTAT__C5OUT" />
            <bitfield mask="0x00000020" name="C6OUT" />
            <bitfield mask="0x00000040" name="C7OUT" />
            <bitfield mask="0x00000080" name="C8OUT" />
            <bitfield mask="0x00000100" name="CVREFSEL" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="CMSTAT__SIDL" />
            <bitfield mask="0x00008000" name="C1EVT" />
            <bitfield mask="0x00020000" name="C2EVT" />
            <bitfield mask="0x00040000" name="C3EVT" />
            <bitfield mask="0x00080000" name="C4EVT" />
            <bitfield mask="0x00100000" name="C5EVT" />
            <bitfield mask="0x00200000" name="C6EVT" />
            <bitfield mask="0x00400000" name="C7EVT" />
            <bitfield mask="0x00800000" name="C8EVT" />
            <bitfield mask="0x03000000" name="PWRMOD" />
         </register>
         <register caption="Op amp/Comparator 'x' Control Register ('x' = 1-5)" name="CM1CON" offset="0x10" rw="RW" size="4">
            <bitfield caption="Comparator Channel Select bits" mask="0x00000003" name="CCH" values="CM1CON__CCH" />
            <bitfield caption="Op amp/Comparator Reference Select bit" mask="0x00000010" name="CREF" values="CM1CON__CREF" />
            <bitfield caption="Trigger/Event Polarity Select bits" mask="0x000000C0" name="EVPOL" values="CM1CON__EVPOL" />
            <bitfield caption="Comparator Output bit" mask="0x00000100" name="COUT" values="CM1CON__COUT" />
            <bitfield mask="0x00000200" name="CEVT" />
            <bitfield caption="Op amp Mode Enable bit" mask="0x00000400" name="AMPMOD" values="CM1CON__AMPMOD" />
            <bitfield caption="Op amp Output Enable bit" mask="0x00000800" name="OAO" values="CM1CON__OAO" />
            <bitfield mask="0x00001000" name="CLPWR" />
            <bitfield caption="Comparator Output Polarity Select bit" mask="0x00002000" name="CPOL" values="CM1CON__CPOL" />
            <bitfield caption="Comparator Output Enable bit" mask="0x00004000" name="COE" values="CM1CON__COE" />
            <bitfield caption="Comparator Enable bit" mask="0x00008000" name="ON" values="CM1CON__ON" />
            <bitfield caption="Comparator Output Filter Clock Divide Select bits" mask="0x00070000" name="CFDIV" values="CM1CON__CFDIV" />
            <bitfield caption="Comparator Output Digital Filter Enable bit" mask="0x00080000" name="CFLTREN" values="CM1CON__CFLTREN" />
            <bitfield caption="Comparator Output Filter Clock Source Select bits" mask="0x00700000" name="CFSEL" values="CM1CON__CFSEL" />
            <bitfield mask="0x03000000" name="HYSSEL" />
         </register>
         <register caption="Op amp/Comparator 'x' Control Register ('x' = 1-5)" name="CM2CON" offset="0x30" rw="RW" size="4">
            <bitfield caption="Comparator Channel Select bits" mask="0x00000003" name="CCH" values="CM2CON__CCH" />
            <bitfield caption="Op amp/Comparator Reference Select bit" mask="0x00000010" name="CREF" values="CM2CON__CREF" />
            <bitfield caption="Trigger/Event Polarity Select bits" mask="0x000000C0" name="EVPOL" values="CM2CON__EVPOL" />
            <bitfield caption="Comparator Output bit" mask="0x00000100" name="COUT" values="CM2CON__COUT" />
            <bitfield mask="0x00000200" name="CEVT" />
            <bitfield caption="Op amp Mode Enable bit" mask="0x00000400" name="AMPMOD" values="CM2CON__AMPMOD" />
            <bitfield caption="Op amp Output Enable bit" mask="0x00000800" name="OAO" values="CM2CON__OAO" />
            <bitfield mask="0x00001000" name="CLPWR" />
            <bitfield caption="Comparator Output Polarity Select bit" mask="0x00002000" name="CPOL" values="CM2CON__CPOL" />
            <bitfield caption="Comparator Output Enable bit" mask="0x00004000" name="COE" values="CM2CON__COE" />
            <bitfield caption="Comparator Enable bit" mask="0x00008000" name="ON" values="CM2CON__ON" />
            <bitfield caption="Comparator Output Filter Clock Divide Select bits" mask="0x00070000" name="CFDIV" values="CM2CON__CFDIV" />
            <bitfield caption="Comparator Output Digital Filter Enable bit" mask="0x00080000" name="CFLTREN" values="CM2CON__CFLTREN" />
            <bitfield caption="Comparator Output Filter Clock Source Select bits" mask="0x00700000" name="CFSEL" values="CM2CON__CFSEL" />
            <bitfield mask="0x03000000" name="HYSSEL" />
         </register>
         <register caption="Op amp/Comparator 'x' Control Register ('x' = 1-5)" name="CM3CON" offset="0x50" rw="RW" size="4">
            <bitfield caption="Comparator Channel Select bits" mask="0x00000003" name="CCH" values="CM3CON__CCH" />
            <bitfield caption="Op amp/Comparator Reference Select bit" mask="0x00000010" name="CREF" values="CM3CON__CREF" />
            <bitfield caption="Trigger/Event Polarity Select bits" mask="0x000000C0" name="EVPOL" values="CM3CON__EVPOL" />
            <bitfield caption="Comparator Output bit" mask="0x00000100" name="COUT" values="CM3CON__COUT" />
            <bitfield mask="0x00000200" name="CEVT" />
            <bitfield caption="Op amp Mode Enable bit" mask="0x00000400" name="AMPMOD" values="CM3CON__AMPMOD" />
            <bitfield caption="Op amp Output Enable bit" mask="0x00000800" name="OAO" values="CM3CON__OAO" />
            <bitfield mask="0x00001000" name="CLPWR" />
            <bitfield caption="Comparator Output Polarity Select bit" mask="0x00002000" name="CPOL" values="CM3CON__CPOL" />
            <bitfield caption="Comparator Output Enable bit" mask="0x00004000" name="COE" values="CM3CON__COE" />
            <bitfield caption="Comparator Enable bit" mask="0x00008000" name="ON" values="CM3CON__ON" />
            <bitfield caption="Comparator Output Filter Clock Divide Select bits" mask="0x00070000" name="CFDIV" values="CM3CON__CFDIV" />
            <bitfield caption="Comparator Output Digital Filter Enable bit" mask="0x00080000" name="CFLTREN" values="CM3CON__CFLTREN" />
            <bitfield caption="Comparator Output Filter Clock Source Select bits" mask="0x00700000" name="CFSEL" values="CM3CON__CFSEL" />
            <bitfield mask="0x03000000" name="HYSSEL" />
         </register>
         <register caption="Op amp/Comparator 'x' Control Register ('x' = 1-5)" name="CM4CON" offset="0x70" rw="RW" size="4">
            <bitfield caption="Comparator Channel Select bits" mask="0x00000003" name="CCH" values="CM4CON__CCH" />
            <bitfield caption="Op amp/Comparator Reference Select bit" mask="0x00000010" name="CREF" values="CM4CON__CREF" />
            <bitfield caption="Trigger/Event Polarity Select bits" mask="0x000000C0" name="EVPOL" values="CM4CON__EVPOL" />
            <bitfield caption="Comparator Output bit" mask="0x00000100" name="COUT" values="CM4CON__COUT" />
            <bitfield mask="0x00000200" name="CEVT" />
            <bitfield caption="Op amp Mode Enable bit" mask="0x00000400" name="AMPMOD" values="CM4CON__AMPMOD" />
            <bitfield caption="Op amp Output Enable bit" mask="0x00000800" name="OAO" values="CM4CON__OAO" />
            <bitfield mask="0x00001000" name="CLPWR" />
            <bitfield caption="Comparator Output Polarity Select bit" mask="0x00002000" name="CPOL" values="CM4CON__CPOL" />
            <bitfield caption="Comparator Output Enable bit" mask="0x00004000" name="COE" values="CM4CON__COE" />
            <bitfield caption="Comparator Enable bit" mask="0x00008000" name="ON" values="CM4CON__ON" />
            <bitfield caption="Comparator Output Filter Clock Divide Select bits" mask="0x00070000" name="CFDIV" values="CM4CON__CFDIV" />
            <bitfield caption="Comparator Output Digital Filter Enable bit" mask="0x00080000" name="CFLTREN" values="CM4CON__CFLTREN" />
            <bitfield caption="Comparator Output Filter Clock Source Select bits" mask="0x00700000" name="CFSEL" values="CM4CON__CFSEL" />
            <bitfield mask="0x03000000" name="HYSSEL" />
         </register>
         <register caption="Op amp/Comparator 'x' Control Register ('x' = 1-5)" name="CM5CON" offset="0x90" rw="RW" size="4">
            <bitfield caption="Comparator Channel Select bits" mask="0x00000003" name="CCH" values="CM5CON__CCH" />
            <bitfield caption="Op amp/Comparator Reference Select bit" mask="0x00000010" name="CREF" values="CM5CON__CREF" />
            <bitfield caption="Trigger/Event Polarity Select bits" mask="0x000000C0" name="EVPOL" values="CM5CON__EVPOL" />
            <bitfield caption="Comparator Output bit" mask="0x00000100" name="COUT" values="CM5CON__COUT" />
            <bitfield mask="0x00000200" name="CEVT" />
            <bitfield caption="Op amp Mode Enable bit" mask="0x00000400" name="AMPMOD" values="CM5CON__AMPMOD" />
            <bitfield caption="Op amp Output Enable bit" mask="0x00000800" name="OAO" values="CM5CON__OAO" />
            <bitfield mask="0x00001000" name="CLPWR" />
            <bitfield caption="Comparator Output Polarity Select bit" mask="0x00002000" name="CPOL" values="CM5CON__CPOL" />
            <bitfield caption="Comparator Output Enable bit" mask="0x00004000" name="COE" values="CM5CON__COE" />
            <bitfield caption="Comparator Enable bit" mask="0x00008000" name="ON" values="CM5CON__ON" />
            <bitfield caption="Comparator Output Filter Clock Divide Select bits" mask="0x00070000" name="CFDIV" values="CM5CON__CFDIV" />
            <bitfield caption="Comparator Output Digital Filter Enable bit" mask="0x00080000" name="CFLTREN" values="CM5CON__CFLTREN" />
            <bitfield caption="Comparator Output Filter Clock Source Select bits" mask="0x00700000" name="CFSEL" values="CM5CON__CFSEL" />
            <bitfield mask="0x03000000" name="HYSSEL" />
         </register>
         <register caption="Comparator 'x' Mask Control Register ('x' = 1-5)" name="CM1MSKCON" offset="0x20" rw="RW" size="4">
            <bitfield caption="AND Gate &quot;A&quot; Inverted Input Enable bit" mask="0x00000001" name="AANEN" values="CM1MSKCON__AANEN" />
            <bitfield caption="AND Gate &quot;A&quot; Input Enable bit" mask="0x00000002" name="AAEN" values="CM1MSKCON__AAEN" />
            <bitfield caption="AND Gate &quot;B&quot; Inverted Input Enable bit" mask="0x00000004" name="ABNEN" values="CM1MSKCON__ABNEN" />
            <bitfield caption="AND Gate &quot;B&quot; Input Enable bit" mask="0x00000008" name="ABEN" values="CM1MSKCON__ABEN" />
            <bitfield caption="AND Gate &quot;C&quot; Inverted Input Enable bit" mask="0x00000010" name="ACNEN" values="CM1MSKCON__ACNEN" />
            <bitfield caption="AND Gate &quot;C&quot; Input Enable bit" mask="0x00000020" name="ACEN" values="CM1MSKCON__ACEN" />
            <bitfield caption="Positive AND Gate Output Select bit" mask="0x00000040" name="PAGS" values="CM1MSKCON__PAGS" />
            <bitfield caption="Negative AND Gate Output Select bit" mask="0x00000080" name="NAGS" values="CM1MSKCON__NAGS" />
            <bitfield caption="OR Gate &quot;A&quot; Input Inverted Enable bit" mask="0x00000100" name="OANEN" values="CM1MSKCON__OANEN" />
            <bitfield caption="OR Gate &quot;A&quot; Input Enable bit" mask="0x00000200" name="OAEN" values="CM1MSKCON__OAEN" />
            <bitfield caption="OR Gate &quot;B&quot; Input Inverted Enable bit" mask="0x00000400" name="OBNEN" values="CM1MSKCON__OBNEN" />
            <bitfield caption="OR Gate &quot;B&quot; Input Enable bit" mask="0x00000800" name="OBEN" values="CM1MSKCON__OBEN" />
            <bitfield caption="OR Gate &quot;C&quot; Input Inverted Enable bit" mask="0x00001000" name="OCNEN" values="CM1MSKCON__OCNEN" />
            <bitfield caption="OR Gate &quot;C&quot; Input Enable bit" mask="0x00002000" name="OCEN" values="CM1MSKCON__OCEN" />
            <bitfield caption="High or Low Level Masking Select bit" mask="0x00008000" name="HLMS" values="CM1MSKCON__HLMS" />
            <bitfield caption="Mask A Input Select bits" mask="0x000F0000" name="SELSRCA" values="CM1MSKCON__SELSRCA" />
            <bitfield mask="0x00F00000" name="SELSRCB" />
            <bitfield mask="0x0F000000" name="SELSRCC" />
         </register>
         <register caption="Comparator 'x' Mask Control Register ('x' = 1-5)" name="CM2MSKCON" offset="0x40" rw="RW" size="4">
            <bitfield caption="AND Gate &quot;A&quot; Inverted Input Enable bit" mask="0x00000001" name="AANEN" values="CM2MSKCON__AANEN" />
            <bitfield caption="AND Gate &quot;A&quot; Input Enable bit" mask="0x00000002" name="AAEN" values="CM2MSKCON__AAEN" />
            <bitfield caption="AND Gate &quot;B&quot; Inverted Input Enable bit" mask="0x00000004" name="ABNEN" values="CM2MSKCON__ABNEN" />
            <bitfield caption="AND Gate &quot;B&quot; Input Enable bit" mask="0x00000008" name="ABEN" values="CM2MSKCON__ABEN" />
            <bitfield caption="AND Gate &quot;C&quot; Inverted Input Enable bit" mask="0x00000010" name="ACNEN" values="CM2MSKCON__ACNEN" />
            <bitfield caption="AND Gate &quot;C&quot; Input Enable bit" mask="0x00000020" name="ACEN" values="CM2MSKCON__ACEN" />
            <bitfield caption="Positive AND Gate Output Select bit" mask="0x00000040" name="PAGS" values="CM2MSKCON__PAGS" />
            <bitfield caption="Negative AND Gate Output Select bit" mask="0x00000080" name="NAGS" values="CM2MSKCON__NAGS" />
            <bitfield caption="OR Gate &quot;A&quot; Input Inverted Enable bit" mask="0x00000100" name="OANEN" values="CM2MSKCON__OANEN" />
            <bitfield caption="OR Gate &quot;A&quot; Input Enable bit" mask="0x00000200" name="OAEN" values="CM2MSKCON__OAEN" />
            <bitfield caption="OR Gate &quot;B&quot; Input Inverted Enable bit" mask="0x00000400" name="OBNEN" values="CM2MSKCON__OBNEN" />
            <bitfield caption="OR Gate &quot;B&quot; Input Enable bit" mask="0x00000800" name="OBEN" values="CM2MSKCON__OBEN" />
            <bitfield caption="OR Gate &quot;C&quot; Input Inverted Enable bit" mask="0x00001000" name="OCNEN" values="CM2MSKCON__OCNEN" />
            <bitfield caption="OR Gate &quot;C&quot; Input Enable bit" mask="0x00002000" name="OCEN" values="CM2MSKCON__OCEN" />
            <bitfield caption="High or Low Level Masking Select bit" mask="0x00008000" name="HLMS" values="CM2MSKCON__HLMS" />
            <bitfield caption="Mask A Input Select bits" mask="0x000F0000" name="SELSRCA" values="CM2MSKCON__SELSRCA" />
            <bitfield mask="0x00F00000" name="SELSRCB" />
            <bitfield mask="0x0F000000" name="SELSRCC" />
         </register>
         <register caption="Comparator 'x' Mask Control Register ('x' = 1-5)" name="CM3MSKCON" offset="0x60" rw="RW" size="4">
            <bitfield caption="AND Gate &quot;A&quot; Inverted Input Enable bit" mask="0x00000001" name="AANEN" values="CM3MSKCON__AANEN" />
            <bitfield caption="AND Gate &quot;A&quot; Input Enable bit" mask="0x00000002" name="AAEN" values="CM3MSKCON__AAEN" />
            <bitfield caption="AND Gate &quot;B&quot; Inverted Input Enable bit" mask="0x00000004" name="ABNEN" values="CM3MSKCON__ABNEN" />
            <bitfield caption="AND Gate &quot;B&quot; Input Enable bit" mask="0x00000008" name="ABEN" values="CM3MSKCON__ABEN" />
            <bitfield caption="AND Gate &quot;C&quot; Inverted Input Enable bit" mask="0x00000010" name="ACNEN" values="CM3MSKCON__ACNEN" />
            <bitfield caption="AND Gate &quot;C&quot; Input Enable bit" mask="0x00000020" name="ACEN" values="CM3MSKCON__ACEN" />
            <bitfield caption="Positive AND Gate Output Select bit" mask="0x00000040" name="PAGS" values="CM3MSKCON__PAGS" />
            <bitfield caption="Negative AND Gate Output Select bit" mask="0x00000080" name="NAGS" values="CM3MSKCON__NAGS" />
            <bitfield caption="OR Gate &quot;A&quot; Input Inverted Enable bit" mask="0x00000100" name="OANEN" values="CM3MSKCON__OANEN" />
            <bitfield caption="OR Gate &quot;A&quot; Input Enable bit" mask="0x00000200" name="OAEN" values="CM3MSKCON__OAEN" />
            <bitfield caption="OR Gate &quot;B&quot; Input Inverted Enable bit" mask="0x00000400" name="OBNEN" values="CM3MSKCON__OBNEN" />
            <bitfield caption="OR Gate &quot;B&quot; Input Enable bit" mask="0x00000800" name="OBEN" values="CM3MSKCON__OBEN" />
            <bitfield caption="OR Gate &quot;C&quot; Input Inverted Enable bit" mask="0x00001000" name="OCNEN" values="CM3MSKCON__OCNEN" />
            <bitfield caption="OR Gate &quot;C&quot; Input Enable bit" mask="0x00002000" name="OCEN" values="CM3MSKCON__OCEN" />
            <bitfield caption="High or Low Level Masking Select bit" mask="0x00008000" name="HLMS" values="CM3MSKCON__HLMS" />
            <bitfield caption="Mask A Input Select bits" mask="0x000F0000" name="SELSRCA" values="CM3MSKCON__SELSRCA" />
            <bitfield mask="0x00F00000" name="SELSRCB" />
            <bitfield mask="0x0F000000" name="SELSRCC" />
         </register>
         <register caption="Comparator 'x' Mask Control Register ('x' = 1-5)" name="CM4MSKCON" offset="0x80" rw="RW" size="4">
            <bitfield caption="AND Gate &quot;A&quot; Inverted Input Enable bit" mask="0x00000001" name="AANEN" values="CM4MSKCON__AANEN" />
            <bitfield caption="AND Gate &quot;A&quot; Input Enable bit" mask="0x00000002" name="AAEN" values="CM4MSKCON__AAEN" />
            <bitfield caption="AND Gate &quot;B&quot; Inverted Input Enable bit" mask="0x00000004" name="ABNEN" values="CM4MSKCON__ABNEN" />
            <bitfield caption="AND Gate &quot;B&quot; Input Enable bit" mask="0x00000008" name="ABEN" values="CM4MSKCON__ABEN" />
            <bitfield caption="AND Gate &quot;C&quot; Inverted Input Enable bit" mask="0x00000010" name="ACNEN" values="CM4MSKCON__ACNEN" />
            <bitfield caption="AND Gate &quot;C&quot; Input Enable bit" mask="0x00000020" name="ACEN" values="CM4MSKCON__ACEN" />
            <bitfield caption="Positive AND Gate Output Select bit" mask="0x00000040" name="PAGS" values="CM4MSKCON__PAGS" />
            <bitfield caption="Negative AND Gate Output Select bit" mask="0x00000080" name="NAGS" values="CM4MSKCON__NAGS" />
            <bitfield caption="OR Gate &quot;A&quot; Input Inverted Enable bit" mask="0x00000100" name="OANEN" values="CM4MSKCON__OANEN" />
            <bitfield caption="OR Gate &quot;A&quot; Input Enable bit" mask="0x00000200" name="OAEN" values="CM4MSKCON__OAEN" />
            <bitfield caption="OR Gate &quot;B&quot; Input Inverted Enable bit" mask="0x00000400" name="OBNEN" values="CM4MSKCON__OBNEN" />
            <bitfield caption="OR Gate &quot;B&quot; Input Enable bit" mask="0x00000800" name="OBEN" values="CM4MSKCON__OBEN" />
            <bitfield caption="OR Gate &quot;C&quot; Input Inverted Enable bit" mask="0x00001000" name="OCNEN" values="CM4MSKCON__OCNEN" />
            <bitfield caption="OR Gate &quot;C&quot; Input Enable bit" mask="0x00002000" name="OCEN" values="CM4MSKCON__OCEN" />
            <bitfield caption="High or Low Level Masking Select bit" mask="0x00008000" name="HLMS" values="CM4MSKCON__HLMS" />
            <bitfield caption="Mask A Input Select bits" mask="0x000F0000" name="SELSRCA" values="CM4MSKCON__SELSRCA" />
            <bitfield mask="0x00F00000" name="SELSRCB" />
            <bitfield mask="0x0F000000" name="SELSRCC" />
         </register>
