Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024MCF100.atdf
      <value-group caption="Comparator Channel Select bits" name="CM3CON__CCH">
         <value caption="CxIN4-" name="" value="0x3" />
         <value caption="CxIN3-" name="" value="0x2" />
         <value caption="CxIN2-" name="" value="0x1" />
         <value caption="CxIN1-" name="" value="0x0" />
      </value-group>
      <value-group caption="Op amp/Comparator Reference Select bit" name="CM3CON__CREF">
         <value caption="VIN+ input connects to internal CDAC3 output voltage" name="" value="0x1" />
         <value caption="VIN+ input connects to CxIN1+ pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger/Event Polarity Select bits" name="CM3CON__EVPOL">
         <value caption="Trigger/Event generated on any change of the comparator output" name="" value="0x3" />
         <value caption="(If CPOL is 0) High-to-low transition of the comparator output / (If CPOL is 1) Low-to-high transition of the comparator output" name="" value="0x2" />
         <value caption="(If CPOL is 0) Low-to-high transition of the comparator output / (If CPOL is 1) High-to-low transition of the comparator output" name="" value="0x1" />
         <value caption="Trigger/Event generation is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output bit" name="CM3CON__COUT">
         <value caption="(When CPOL is 0)VIN+ &gt; VTH+ / (When CPOL is 1) VIN+  VTH+ / (When CPOL is 1) VIN+ &lt; VTH-" name="" value="0x1" />
         <value caption="(When CPOL is 0)VIN+  VTH+" name="" value="0x0" />
      </value-group>
      <value-group caption="Op amp Mode Enable bit" name="CM3CON__AMPMOD">
         <value caption="Amplifier/Comparator operating in Dual mode (both Op amps and Comparators are enabled)" name="" value="0x1" />
         <value caption="Amplifier/Comparator operating in Comparator-only mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Op amp Output Enable bit" name="CM3CON__OAO">
         <value caption="Op amp output is present on the OAxOUT pin" name="" value="0x1" />
         <value caption="Op amp output is not present on the OAxOUT pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output Polarity Select bit" name="CM3CON__CPOL">
         <value caption="Comparator output is inverted" name="" value="0x1" />
         <value caption="Comparator output is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output Enable bit" name="CM3CON__COE">
         <value caption="Comparator output is present on the CxOUT pin" name="" value="0x1" />
         <value caption="Comparator output is internal only" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Enable bit" name="CM3CON__ON">
         <value caption="Comparator is enabled" name="" value="0x1" />
         <value caption="Comparator is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output Filter Clock Divide Select bits" name="CM3CON__CFDIV">
         <value caption="1:128 Clock Divide" name="" value="0x7" />
         <value caption="1:64 Clock Divide" name="" value="0x6" />
         <value caption="1:32 Clock Divide" name="" value="0x5" />
         <value caption="1:16 Clock Divide" name="" value="0x4" />
         <value caption="1:8 Clock Divide" name="" value="0x3" />
         <value caption="1:4 Clock Divide" name="" value="0x2" />
         <value caption="1:2 Clock Divide" name="" value="0x1" />
         <value caption="1:1 Clock Divide" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output Digital Filter Enable bit" name="CM3CON__CFLTREN">
         <value caption="Digital Filters enabled" name="" value="0x1" />
         <value caption="Digital Filters disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output Filter Clock Source Select bits" name="CM3CON__CFSEL">
         <value caption="PBCLK2/Timer5 Period Value (PR5)" name="" value="0x7" />
         <value caption="PBCLK2/Timer4 Period Value (PR4)" name="" value="0x6" />
         <value caption="PBCLK2/Timer3 Period Value (PR3)" name="" value="0x5" />
         <value caption="PBCLK2/Timer2 Period Value (PR2)" name="" value="0x4" />
         <value caption="REFCLK3 Clock" name="" value="0x3" />
         <value caption="PWM Secondary Special Event" name="" value="0x2" />
         <value caption="PPBCLK2 Clock" name="" value="0x1" />
         <value caption="SYSCLK Clock" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Channel Select bits" name="CM4CON__CCH">
         <value caption="CxIN4-" name="" value="0x3" />
         <value caption="CxIN3-" name="" value="0x2" />
         <value caption="CxIN2-" name="" value="0x1" />
         <value caption="CxIN1-" name="" value="0x0" />
      </value-group>
      <value-group caption="Op amp/Comparator Reference Select bit" name="CM4CON__CREF">
         <value caption="VIN+ input connects to internal CDAC3 output voltage" name="" value="0x1" />
         <value caption="VIN+ input connects to CxIN1+ pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger/Event Polarity Select bits" name="CM4CON__EVPOL">
         <value caption="Trigger/Event generated on any change of the comparator output" name="" value="0x3" />
         <value caption="(If CPOL is 0) High-to-low transition of the comparator output / (If CPOL is 1) Low-to-high transition of the comparator output" name="" value="0x2" />
         <value caption="(If CPOL is 0) Low-to-high transition of the comparator output / (If CPOL is 1) High-to-low transition of the comparator output" name="" value="0x1" />
         <value caption="Trigger/Event generation is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output bit" name="CM4CON__COUT">
         <value caption="(When CPOL is 0)VIN+ &gt; VTH+ / (When CPOL is 1) VIN+  VTH+ / (When CPOL is 1) VIN+ &lt; VTH-" name="" value="0x1" />
         <value caption="(When CPOL is 0)VIN+  VTH+" name="" value="0x0" />
      </value-group>
      <value-group caption="Op amp Mode Enable bit" name="CM4CON__AMPMOD">
         <value caption="Amplifier/Comparator operating in Dual mode (both Op amps and Comparators are enabled)" name="" value="0x1" />
         <value caption="Amplifier/Comparator operating in Comparator-only mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Op amp Output Enable bit" name="CM4CON__OAO">
         <value caption="Op amp output is present on the OAxOUT pin" name="" value="0x1" />
         <value caption="Op amp output is not present on the OAxOUT pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output Polarity Select bit" name="CM4CON__CPOL">
         <value caption="Comparator output is inverted" name="" value="0x1" />
         <value caption="Comparator output is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output Enable bit" name="CM4CON__COE">
         <value caption="Comparator output is present on the CxOUT pin" name="" value="0x1" />
         <value caption="Comparator output is internal only" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Enable bit" name="CM4CON__ON">
         <value caption="Comparator is enabled" name="" value="0x1" />
         <value caption="Comparator is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output Filter Clock Divide Select bits" name="CM4CON__CFDIV">
         <value caption="1:128 Clock Divide" name="" value="0x7" />
         <value caption="1:64 Clock Divide" name="" value="0x6" />
         <value caption="1:32 Clock Divide" name="" value="0x5" />
         <value caption="1:16 Clock Divide" name="" value="0x4" />
         <value caption="1:8 Clock Divide" name="" value="0x3" />
         <value caption="1:4 Clock Divide" name="" value="0x2" />
         <value caption="1:2 Clock Divide" name="" value="0x1" />
         <value caption="1:1 Clock Divide" name="" value="0x0" />
      </value-group>
