Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024MCF100.atdf
         <register caption="Input Capture x Control Register" name="IC8CON" offset="0xe00" rw="RW" size="4">
            <bitfield caption="Input Capture Mode Select bits" mask="0x00000007" name="ICM" values="IC8CON__ICM" />
            <bitfield caption="Input Capture Buffer Not Empty Status bit" mask="0x00000008" name="ICBNE" values="IC8CON__ICBNE" />
            <bitfield caption="Input Capture Overflow Status Flag bit" mask="0x00000010" name="ICOV" values="IC8CON__ICOV" />
            <bitfield caption="Interrupt Control bits" mask="0x00000060" name="ICI" values="IC8CON__ICI"/>
            <bitfield caption="Timer Select bit" mask="0x00000080" name="ICTMR" values="IC8CON__ICTMR" />
            <bitfield caption="32-bit Capture Select bit" mask="0x00000100" name="C32" values="IC8CON__C32" />
            <bitfield caption="First Capture Edge Select bit" mask="0x00000200" name="FEDGE" values="IC8CON__FEDGE" />
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="IC8CON__SIDL" />
            <bitfield caption="Input Capture Module Enable bit" mask="0x00008000" name="ON" values="IC8CON__ON" />
         </register>
         <register caption="Input Capture x Control Register" name="IC9CON" offset="0x1000" rw="RW" size="4">
            <bitfield caption="Input Capture Mode Select bits" mask="0x00000007" name="ICM" values="IC9CON__ICM" />
            <bitfield caption="Input Capture Buffer Not Empty Status bit" mask="0x00000008" name="ICBNE" values="IC9CON__ICBNE" />
            <bitfield caption="Input Capture Overflow Status Flag bit" mask="0x00000010" name="ICOV" values="IC9CON__ICOV" />
            <bitfield caption="Interrupt Control bits" mask="0x00000060" name="ICI" values="IC9CON__ICI"/>
            <bitfield caption="Timer Select bit" mask="0x00000080" name="ICTMR" values="IC9CON__ICTMR" />
            <bitfield caption="32-bit Capture Select bit" mask="0x00000100" name="C32" values="IC9CON__C32" />
            <bitfield caption="First Capture Edge Select bit" mask="0x00000200" name="FEDGE" values="IC9CON__FEDGE" />
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="IC9CON__SIDL" />
            <bitfield caption="Input Capture Module Enable bit" mask="0x00008000" name="ON" values="IC9CON__ON" />
         </register>
         <register caption="Input Capture x Control Register" name="IC10CON" offset="0x21200" rw="RW" size="4">
            <bitfield caption="Input Capture Mode Select bits" mask="0x00000007" name="ICM" values="IC10CON__ICM" />
            <bitfield caption="Input Capture Buffer Not Empty Status bit" mask="0x00000008" name="ICBNE" values="IC10CON__ICBNE" />
            <bitfield caption="Input Capture Overflow Status Flag bit" mask="0x00000010" name="ICOV" values="IC10CON__ICOV" />
            <bitfield caption="Interrupt Control bits" mask="0x00000060" name="ICI" values="IC10CON__ICI"/>
            <bitfield caption="Timer Select bit" mask="0x00000080" name="ICTMR" values="IC10CON__ICTMR" />
            <bitfield caption="32-bit Capture Select bit" mask="0x00000100" name="C32" values="IC10CON__C32" />
            <bitfield caption="First Capture Edge Select bit" mask="0x00000200" name="FEDGE" values="IC10CON__FEDGE" />
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="IC10CON__SIDL" />
            <bitfield caption="Input Capture Module Enable bit" mask="0x00008000" name="ON" values="IC10CON__ON" />
         </register>
         <register caption="Input Capture x Control Register" name="IC11CON" offset="0x21400" rw="RW" size="4">
            <bitfield caption="Input Capture Mode Select bits" mask="0x00000007" name="ICM" values="IC11CON__ICM" />
            <bitfield caption="Input Capture Buffer Not Empty Status bit" mask="0x00000008" name="ICBNE" values="IC11CON__ICBNE" />
            <bitfield caption="Input Capture Overflow Status Flag bit" mask="0x00000010" name="ICOV" values="IC11CON__ICOV" />
            <bitfield caption="Interrupt Control bits" mask="0x00000060" name="ICI" values="IC11CON__ICI"/>
            <bitfield caption="Timer Select bit" mask="0x00000080" name="ICTMR" values="IC11CON__ICTMR" />
            <bitfield caption="32-bit Capture Select bit" mask="0x00000100" name="C32" values="IC11CON__C32" />
            <bitfield caption="First Capture Edge Select bit" mask="0x00000200" name="FEDGE" values="IC11CON__FEDGE" />
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="IC11CON__SIDL" />
            <bitfield caption="Input Capture Module Enable bit" mask="0x00008000" name="ON" values="IC11CON__ON" />
         </register>
         <register caption="Input Capture x Control Register" name="IC12CON" offset="0x21600" rw="RW" size="4">
            <bitfield caption="Input Capture Mode Select bits" mask="0x00000007" name="ICM" values="IC12CON__ICM" />
            <bitfield caption="Input Capture Buffer Not Empty Status bit" mask="0x00000008" name="ICBNE" values="IC12CON__ICBNE" />
            <bitfield caption="Input Capture Overflow Status Flag bit" mask="0x00000010" name="ICOV" values="IC12CON__ICOV" />
            <bitfield caption="Interrupt Control bits" mask="0x00000060" name="ICI" values="IC12CON__ICI"/>
            <bitfield caption="Timer Select bit" mask="0x00000080" name="ICTMR" values="IC12CON__ICTMR" />
            <bitfield caption="32-bit Capture Select bit" mask="0x00000100" name="C32" values="IC12CON__C32" />
            <bitfield caption="First Capture Edge Select bit" mask="0x00000200" name="FEDGE" values="IC12CON__FEDGE" />
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="IC12CON__SIDL" />
            <bitfield caption="Input Capture Module Enable bit" mask="0x00008000" name="ON" values="IC12CON__ON" />
         </register>
         <register caption="Input Capture x Control Register" name="IC13CON" offset="0x21800" rw="RW" size="4">
            <bitfield caption="Input Capture Mode Select bits" mask="0x00000007" name="ICM" values="IC13CON__ICM" />
            <bitfield caption="Input Capture Buffer Not Empty Status bit" mask="0x00000008" name="ICBNE" values="IC13CON__ICBNE" />
            <bitfield caption="Input Capture Overflow Status Flag bit" mask="0x00000010" name="ICOV" values="IC13CON__ICOV" />
            <bitfield caption="Interrupt Control bits" mask="0x00000060" name="ICI" values="IC13CON__ICI"/>
            <bitfield caption="Timer Select bit" mask="0x00000080" name="ICTMR" values="IC13CON__ICTMR" />
            <bitfield caption="32-bit Capture Select bit" mask="0x00000100" name="C32" values="IC13CON__C32" />
            <bitfield caption="First Capture Edge Select bit" mask="0x00000200" name="FEDGE" values="IC13CON__FEDGE" />
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="IC13CON__SIDL" />
            <bitfield caption="Input Capture Module Enable bit" mask="0x00008000" name="ON" values="IC13CON__ON" />
         </register>
         <register caption="Input Capture x Control Register" name="IC14CON" offset="0x21a00" rw="RW" size="4">
            <bitfield caption="Input Capture Mode Select bits" mask="0x00000007" name="ICM" values="IC14CON__ICM" />
            <bitfield caption="Input Capture Buffer Not Empty Status bit" mask="0x00000008" name="ICBNE" values="IC14CON__ICBNE" />
            <bitfield caption="Input Capture Overflow Status Flag bit" mask="0x00000010" name="ICOV" values="IC14CON__ICOV" />
            <bitfield caption="Interrupt Control bits" mask="0x00000060" name="ICI" values="IC14CON__ICI"/>
            <bitfield caption="Timer Select bit" mask="0x00000080" name="ICTMR" values="IC14CON__ICTMR" />
            <bitfield caption="32-bit Capture Select bit" mask="0x00000100" name="C32" values="IC14CON__C32" />
            <bitfield caption="First Capture Edge Select bit" mask="0x00000200" name="FEDGE" values="IC14CON__FEDGE" />
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="IC14CON__SIDL" />
            <bitfield caption="Input Capture Module Enable bit" mask="0x00008000" name="ON" values="IC14CON__ON" />
         </register>
