Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024MCF100.atdf
         <register caption="Interrupt Enable Control Register " name="IEC4" offset="0x100" rw="RW" size="4">
            <bitfield mask="0x00000001" name="AD1D22IE" />
            <bitfield mask="0x00000002" name="AD1D23IE" />
            <bitfield mask="0x00000004" name="AD1D24IE" />
            <bitfield mask="0x00000008" name="AD1D25IE" />
            <bitfield mask="0x00000010" name="AD1D26IE" />
            <bitfield mask="0x00000020" name="AD1D27IE" />
            <bitfield mask="0x00000800" name="AD1D33IE" />
            <bitfield mask="0x00001000" name="AD1D34IE" />
            <bitfield mask="0x00002000" name="AD1D35IE" />
            <bitfield mask="0x00004000" name="AD1D36IE" />
            <bitfield mask="0x00008000" name="AD1D37IE" />
            <bitfield mask="0x00010000" name="AD1D38IE" />
            <bitfield mask="0x00020000" name="AD1D39IE" />
            <bitfield mask="0x00040000" name="AD1D40IE" />
            <bitfield mask="0x00080000" name="AD1D41IE" />
            <bitfield mask="0x00800000" name="AD1D45IE" />
            <bitfield mask="0x01000000" name="AD1D46IE" />
            <bitfield mask="0x02000000" name="AD1D47IE" />
            <bitfield mask="0x04000000" name="AD1D48IE" />
            <bitfield mask="0x08000000" name="AD1D49IE" />
            <bitfield mask="0x10000000" name="AD1D50IE" />
            <bitfield mask="0x20000000" name="AD1D51IE" />
            <bitfield mask="0x40000000" name="AD1D52IE" />
            <bitfield mask="0x80000000" name="AD1D53IE" />
         </register>
         <register caption="Interrupt Enable Control Register " name="IEC5" offset="0x110" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CMP3IE" />
            <bitfield mask="0x00000002" name="CMP4IE" />
            <bitfield mask="0x00000004" name="CMP5IE" />
            <bitfield mask="0x00000010" name="U6EIE" />
            <bitfield mask="0x00000020" name="U6RXIE" />
            <bitfield mask="0x00000040" name="U6TXIE" />
            <bitfield mask="0x00000080" name="CAN1IE" />
            <bitfield mask="0x00000100" name="CAN2IE" />
            <bitfield mask="0x00000200" name="QEI1IE" />
            <bitfield mask="0x00000400" name="QEI2IE" />
            <bitfield mask="0x00000800" name="PWMPEVTIE" />
            <bitfield mask="0x00001000" name="PWMSEVTIE" />
            <bitfield mask="0x00002000" name="PWM1IE" />
            <bitfield mask="0x00004000" name="PWM2IE" />
            <bitfield mask="0x00008000" name="PWM3IE" />
            <bitfield mask="0x00010000" name="PWM4IE" />
            <bitfield mask="0x00020000" name="PWM5IE" />
            <bitfield mask="0x00040000" name="PWM6IE" />
            <bitfield mask="0x00080000" name="I2C3BIE" />
            <bitfield mask="0x00100000" name="I2C3SIE" />
            <bitfield mask="0x00200000" name="I2C3MIE" />
            <bitfield mask="0x00400000" name="DMA4IE" />
            <bitfield mask="0x00800000" name="DMA5IE" />
            <bitfield mask="0x01000000" name="DMA6IE" />
            <bitfield mask="0x02000000" name="DMA7IE" />
            <bitfield mask="0x04000000" name="DATAEEIE" />
            <bitfield mask="0x08000000" name="CAN3IE" />
            <bitfield mask="0x10000000" name="CAN4IE" />
            <bitfield mask="0x20000000" name="QEI3IE" />
            <bitfield mask="0x40000000" name="QEI4IE" />
            <bitfield mask="0x80000000" name="QEI5IE" />
         </register>
         <register caption="Interrupt Enable Control Register " name="IEC6" offset="0x120" rw="RW" size="4">
            <bitfield mask="0x00000001" name="QEI6IE" />
            <bitfield mask="0x00000004" name="I2C4BIE" />
            <bitfield mask="0x00000008" name="I2C4SIE" />
            <bitfield mask="0x00000010" name="I2C4MIE" />
            <bitfield mask="0x00000020" name="IC10EIE" />
            <bitfield mask="0x00000040" name="IC10IE" />
            <bitfield mask="0x00000080" name="OC10IE" />
            <bitfield mask="0x00000100" name="IC11EIE" />
            <bitfield mask="0x00000200" name="IC11IE" />
            <bitfield mask="0x00000400" name="OC11IE" />
            <bitfield mask="0x00000800" name="IC12EIE" />
            <bitfield mask="0x00001000" name="IC12IE" />
            <bitfield mask="0x00002000" name="OC12IE" />
            <bitfield mask="0x00004000" name="IC13EIE" />
            <bitfield mask="0x00008000" name="IC13IE" />
            <bitfield mask="0x00010000" name="OC13IE" />
            <bitfield mask="0x00020000" name="IC14EIE" />
            <bitfield mask="0x00040000" name="IC14IE" />
            <bitfield mask="0x00080000" name="OC14IE" />
            <bitfield mask="0x00100000" name="IC15EIE" />
            <bitfield mask="0x00200000" name="IC15IE" />
            <bitfield mask="0x00400000" name="OC15IE" />
            <bitfield mask="0x00800000" name="IC16EIE" />
            <bitfield mask="0x01000000" name="IC16IE" />
            <bitfield mask="0x02000000" name="OC16IE" />
            <bitfield mask="0x04000000" name="SPI3EIE" />
            <bitfield mask="0x08000000" name="SPI3RXIE" />
            <bitfield mask="0x10000000" name="SPI3TXIE" />
            <bitfield mask="0x20000000" name="SPI4EIE" />
            <bitfield mask="0x40000000" name="SPI4RXIE" />
            <bitfield mask="0x80000000" name="SPI4TXIE" />
         </register>
         <register caption="Interrupt Enable Control Register " name="IEC7" offset="0x130" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SPI5EIE" />
            <bitfield mask="0x00000002" name="SPI5RXIE" />
            <bitfield mask="0x00000004" name="SPI5TXIE" />
            <bitfield mask="0x00000008" name="SPI6EIE" />
            <bitfield mask="0x00000010" name="SPI6RXIE" />
            <bitfield mask="0x00000020" name="SPI6TXIE" />
            <bitfield mask="0x00000040" name="SBIE" />
            <bitfield mask="0x00000080" name="PTGSTEPIE" />
            <bitfield mask="0x00000100" name="PTGWDTIE" />
            <bitfield mask="0x00000200" name="PTG0TR0" />
            <bitfield mask="0x00000400" name="PTG0TR1" />
            <bitfield mask="0x00000800" name="PTG0TR2" />
            <bitfield mask="0x00001000" name="PTG0TR3" />
            <bitfield mask="0x00004000" name="PWM7IE" />
            <bitfield mask="0x00008000" name="PWM8IE" />
            <bitfield mask="0x00010000" name="PWM9IE" />
            <bitfield mask="0x00020000" name="PWM10IE" />
            <bitfield mask="0x00040000" name="PWM11IE" />
            <bitfield mask="0x00080000" name="PWM12IE" />
            <bitfield mask="0x00100000" name="USB2IE" />
            <bitfield mask="0x00200000" name="AD1DC3IE" />
            <bitfield mask="0x00400000" name="AD1DC4IE" />
            <bitfield mask="0x40000000" name="CPCIE" />
            <bitfield mask="0x80000000" name="CFDCIE" />
         </register>
