Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024MCF100.atdf
         <register caption="" name="OFF243" offset="0x90c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF244" offset="0x910" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF245" offset="0x914" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF246" offset="0x918" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF254" offset="0x938" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF255" offset="0x93c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
      </register-group>
      <value-group caption="External Interrupt 0 Edge Polarity Control bit" name="INTCON__INT0EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
      <value-group caption="External Interrupt 1 Edge" name="INTCON__INT1EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
      <value-group caption="External Interrupt 2 Edge" name="INTCON__INT2EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
      <value-group caption="External Interrupt 3 Edge" name="INTCON__INT3EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
      <value-group caption="External Interrupt 4 Edge" name="INTCON__INT4EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt Proximity Timer Control bits" name="INTCON__TPC">
         <value caption="Interrupts of group priority 7 or lower start the Interrupt Proximity timer" name="" value="0x7" />
         <value caption="Interrupts of group priority 6 or lower start the Interrupt Proximity timer" name="" value="0x6" />
         <value caption="Interrupts of group priority 5 or lower start the Interrupt Proximity timer" name="" value="0x5" />
         <value caption="Interrupts of group priority 4 or lower start the Interrupt Proximity timer" name="" value="0x4" />
         <value caption="Interrupts of group priority 3 or lower start the Interrupt Proximity timer" name="" value="0x3" />
         <value caption="Interrupts of group priority 2 or lower start the Interrupt Proximity timer" name="" value="0x2" />
         <value caption="Interrupts of group priority 1 start the Interrupt Proximity timer" name="" value="0x1" />
         <value caption="Disables Interrupt Proximity timer" name="" value="0x0" />
      </value-group>
      <value-group caption="Multi Vector Configuration bit" name="INTCON__MVEC">
         <value caption="Interrupt controller configured for multi vectored mode" name="" value="0x1" />
         <value caption="Interrupt controller configured for single vectored mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Single Vector Shadow Register Set bit" name="PRISS__SS0">
         <value caption="Single vector is presented with a shadow set" name="" value="0x1" />
         <value caption="Single vector is not presented with a shadow set" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt with Priority Level 1 Shadow Set bits" name="PRISS__PRI1SS">
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Reserved" name="" value="0xe" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Reserved" name="" value="0xc" />
         <value caption="Reserved" name="" value="0xb" />
         <value caption="Reserved" name="" value="0xa" />
         <value caption="Reserved" name="" value="0x9" />
         <value caption="Reserved" name="" value="0x8" />
         <value caption="Reserved" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x6" />
         <value caption="Reserved" name="" value="0x5" />
         <value caption="Reserved" name="" value="0x4" />
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Reserved" name="" value="0x2" />
         <value caption="Interrupt with a priority level of 1 uses Shadow Set 1" name="" value="0x1" />
         <value caption="Interrupt with a priority level of 1 uses Shadow Set 0 (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt with Priority Level 2 Shadow Set bits" name="PRISS__PRI2SS">
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Reserved" name="" value="0xe" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Reserved" name="" value="0xc" />
         <value caption="Reserved" name="" value="0xb" />
         <value caption="Reserved" name="" value="0xa" />
         <value caption="Reserved" name="" value="0x9" />
         <value caption="Reserved" name="" value="0x8" />
         <value caption="Reserved" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x6" />
         <value caption="Reserved" name="" value="0x5" />
         <value caption="Reserved" name="" value="0x4" />
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Reserved" name="" value="0x2" />
         <value caption="Interrupt with a priority level of 2 uses Shadow Set 1" name="" value="0x1" />
         <value caption="Interrupt with a priority level of 2 uses Shadow Set 0 (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt with Priority Level 3 Shadow Set bits" name="PRISS__PRI3SS">
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Reserved" name="" value="0xe" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Reserved" name="" value="0xc" />
         <value caption="Reserved" name="" value="0xb" />
         <value caption="Reserved" name="" value="0xa" />
         <value caption="Reserved" name="" value="0x9" />
         <value caption="Reserved" name="" value="0x8" />
         <value caption="Reserved" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x6" />
         <value caption="Reserved" name="" value="0x5" />
         <value caption="Reserved" name="" value="0x4" />
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Reserved" name="" value="0x2" />
         <value caption="Interrupt with a priority level of 3 uses Shadow Set 1" name="" value="0x1" />
         <value caption="Interrupt with a priority level of 3 uses Shadow Set 0 (default)" name="" value="0x0" />
      </value-group>
