Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024MCF100.atdf
         <register caption="PWM Trigger Control Register x (x = 1 through 12)" name="TRGCON6" offset="0x650" rw="RW" size="4">
            <bitfield caption="Secondary Trigger Interrupt Select" mask="0x00000040" name="STRGIS" values="TRGCON6__STRGIS" />
            <bitfield caption="Dual ADC Trigger Mode" mask="0x00000080" name="DTM" values="TRGCON6__DTM" />
            <bitfield caption="Secondary Trigger Cycle Selection bits for Dual Cycle PWM Cycles" mask="0x00000300" name="STRGSEL" values="TRGCON6__STRGSEL" />
            <bitfield caption="Trigger Cycle Selection for Dual Cycle PWM Cycles" mask="0x00000C00" name="TRGSEL" values="TRGCON6__TRGSEL" />
            <bitfield caption="Trigger x Output Divider bits" mask="0x0000F000" name="TRGDIV" values="TRGCON6__TRGDIV" />
         </register>
         <register caption="PWM Trigger Control Register x (x = 1 through 12)" name="TRGCON7" offset="0x750" rw="RW" size="4">
            <bitfield caption="Secondary Trigger Interrupt Select" mask="0x00000040" name="STRGIS" values="TRGCON7__STRGIS" />
            <bitfield caption="Dual ADC Trigger Mode" mask="0x00000080" name="DTM" values="TRGCON7__DTM" />
            <bitfield caption="Secondary Trigger Cycle Selection bits for Dual Cycle PWM Cycles" mask="0x00000300" name="STRGSEL" values="TRGCON7__STRGSEL" />
            <bitfield caption="Trigger Cycle Selection for Dual Cycle PWM Cycles" mask="0x00000C00" name="TRGSEL" values="TRGCON7__TRGSEL" />
            <bitfield caption="Trigger x Output Divider bits" mask="0x0000F000" name="TRGDIV" values="TRGCON7__TRGDIV" />
         </register>
         <register caption="PWM Trigger Control Register x (x = 1 through 12)" name="TRGCON8" offset="0x850" rw="RW" size="4">
            <bitfield caption="Secondary Trigger Interrupt Select" mask="0x00000040" name="STRGIS" values="TRGCON8__STRGIS" />
            <bitfield caption="Dual ADC Trigger Mode" mask="0x00000080" name="DTM" values="TRGCON8__DTM" />
            <bitfield caption="Secondary Trigger Cycle Selection bits for Dual Cycle PWM Cycles" mask="0x00000300" name="STRGSEL" values="TRGCON8__STRGSEL" />
            <bitfield caption="Trigger Cycle Selection for Dual Cycle PWM Cycles" mask="0x00000C00" name="TRGSEL" values="TRGCON8__TRGSEL" />
            <bitfield caption="Trigger x Output Divider bits" mask="0x0000F000" name="TRGDIV" values="TRGCON8__TRGDIV" />
         </register>
         <register caption="PWM Trigger Control Register x (x = 1 through 12)" name="TRGCON9" offset="0x950" rw="RW" size="4">
            <bitfield caption="Secondary Trigger Interrupt Select" mask="0x00000040" name="STRGIS" values="TRGCON9__STRGIS" />
            <bitfield caption="Dual ADC Trigger Mode" mask="0x00000080" name="DTM" values="TRGCON9__DTM" />
            <bitfield caption="Secondary Trigger Cycle Selection bits for Dual Cycle PWM Cycles" mask="0x00000300" name="STRGSEL" values="TRGCON9__STRGSEL" />
            <bitfield caption="Trigger Cycle Selection for Dual Cycle PWM Cycles" mask="0x00000C00" name="TRGSEL" values="TRGCON9__TRGSEL" />
            <bitfield caption="Trigger x Output Divider bits" mask="0x0000F000" name="TRGDIV" values="TRGCON9__TRGDIV" />
         </register>
         <register caption="PWM Trigger Control Register x (x = 1 through 12)" name="TRGCON10" offset="0xa50" rw="RW" size="4">
            <bitfield caption="Secondary Trigger Interrupt Select" mask="0x00000040" name="STRGIS" values="TRGCON10__STRGIS" />
            <bitfield caption="Dual ADC Trigger Mode" mask="0x00000080" name="DTM" values="TRGCON10__DTM" />
            <bitfield caption="Secondary Trigger Cycle Selection bits for Dual Cycle PWM Cycles" mask="0x00000300" name="STRGSEL" values="TRGCON10__STRGSEL" />
            <bitfield caption="Trigger Cycle Selection for Dual Cycle PWM Cycles" mask="0x00000C00" name="TRGSEL" values="TRGCON10__TRGSEL" />
            <bitfield caption="Trigger x Output Divider bits" mask="0x0000F000" name="TRGDIV" values="TRGCON10__TRGDIV" />
         </register>
         <register caption="PWM Trigger Control Register x (x = 1 through 12)" name="TRGCON11" offset="0xb50" rw="RW" size="4">
            <bitfield caption="Secondary Trigger Interrupt Select" mask="0x00000040" name="STRGIS" values="TRGCON11__STRGIS" />
            <bitfield caption="Dual ADC Trigger Mode" mask="0x00000080" name="DTM" values="TRGCON11__DTM" />
            <bitfield caption="Secondary Trigger Cycle Selection bits for Dual Cycle PWM Cycles" mask="0x00000300" name="STRGSEL" values="TRGCON11__STRGSEL" />
            <bitfield caption="Trigger Cycle Selection for Dual Cycle PWM Cycles" mask="0x00000C00" name="TRGSEL" values="TRGCON11__TRGSEL" />
            <bitfield caption="Trigger x Output Divider bits" mask="0x0000F000" name="TRGDIV" values="TRGCON11__TRGDIV" />
         </register>
         <register caption="PWM Trigger Control Register x (x = 1 through 12)" name="TRGCON12" offset="0xc50" rw="RW" size="4">
            <bitfield caption="Secondary Trigger Interrupt Select" mask="0x00000040" name="STRGIS" values="TRGCON12__STRGIS" />
            <bitfield caption="Dual ADC Trigger Mode" mask="0x00000080" name="DTM" values="TRGCON12__DTM" />
            <bitfield caption="Secondary Trigger Cycle Selection bits for Dual Cycle PWM Cycles" mask="0x00000300" name="STRGSEL" values="TRGCON12__STRGSEL" />
            <bitfield caption="Trigger Cycle Selection for Dual Cycle PWM Cycles" mask="0x00000C00" name="TRGSEL" values="TRGCON12__TRGSEL" />
            <bitfield caption="Trigger x Output Divider bits" mask="0x0000F000" name="TRGDIV" values="TRGCON12__TRGDIV" />
         </register>
         <register caption="Secondary PWM Trigger Compare Register x (x = 1 through 12)" name="STRIG1" offset="0x160" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="STRGCMP" />
         </register>
         <register caption="Secondary PWM Trigger Compare Register x (x = 1 through 12)" name="STRIG2" offset="0x260" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="STRGCMP" />
         </register>
         <register caption="Secondary PWM Trigger Compare Register x (x = 1 through 12)" name="STRIG3" offset="0x360" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="STRGCMP" />
         </register>
