Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024MCF100.atdf
         <register caption="Leading-Edge Blanking Control Register x (x = 1 through 12)" name="LEBCON4" offset="0x480" rw="RW" size="4">
            <bitfield caption="Current-Limit Leading-Edge Blanking Enable bit" mask="0x00000400" name="CLLEBEN" values="LEBCON4__CLLEBEN" />
            <bitfield caption="Fault Input Leading-Edge Blanking Enable bit" mask="0x00000800" name="FLTLEBEN" values="LEBCON4__FLTLEBEN" />
            <bitfield caption="PWMxL Falling Edge Trigger Enable bit" mask="0x00001000" name="PLF" values="LEBCON4__PLF" />
            <bitfield caption="PWMxL Rising Edge Trigger Enable bit" mask="0x00002000" name="PLR" values="LEBCON4__PLR" />
            <bitfield caption="PWMxH Falling Edge Trigger Enable bit" mask="0x00004000" name="PHF" values="LEBCON4__PHF" />
            <bitfield caption="PWMxH Rising Edge Trigger Enable bit" mask="0x00008000" name="PHR" values="LEBCON4__PHR" />
         </register>
         <register caption="Leading-Edge Blanking Control Register x (x = 1 through 12)" name="LEBCON5" offset="0x580" rw="RW" size="4">
            <bitfield caption="Current-Limit Leading-Edge Blanking Enable bit" mask="0x00000400" name="CLLEBEN" values="LEBCON5__CLLEBEN" />
            <bitfield caption="Fault Input Leading-Edge Blanking Enable bit" mask="0x00000800" name="FLTLEBEN" values="LEBCON5__FLTLEBEN" />
            <bitfield caption="PWMxL Falling Edge Trigger Enable bit" mask="0x00001000" name="PLF" values="LEBCON5__PLF" />
            <bitfield caption="PWMxL Rising Edge Trigger Enable bit" mask="0x00002000" name="PLR" values="LEBCON5__PLR" />
            <bitfield caption="PWMxH Falling Edge Trigger Enable bit" mask="0x00004000" name="PHF" values="LEBCON5__PHF" />
            <bitfield caption="PWMxH Rising Edge Trigger Enable bit" mask="0x00008000" name="PHR" values="LEBCON5__PHR" />
         </register>
         <register caption="Leading-Edge Blanking Control Register x (x = 1 through 12)" name="LEBCON6" offset="0x680" rw="RW" size="4">
            <bitfield caption="Current-Limit Leading-Edge Blanking Enable bit" mask="0x00000400" name="CLLEBEN" values="LEBCON6__CLLEBEN" />
            <bitfield caption="Fault Input Leading-Edge Blanking Enable bit" mask="0x00000800" name="FLTLEBEN" values="LEBCON6__FLTLEBEN" />
            <bitfield caption="PWMxL Falling Edge Trigger Enable bit" mask="0x00001000" name="PLF" values="LEBCON6__PLF" />
            <bitfield caption="PWMxL Rising Edge Trigger Enable bit" mask="0x00002000" name="PLR" values="LEBCON6__PLR" />
            <bitfield caption="PWMxH Falling Edge Trigger Enable bit" mask="0x00004000" name="PHF" values="LEBCON6__PHF" />
            <bitfield caption="PWMxH Rising Edge Trigger Enable bit" mask="0x00008000" name="PHR" values="LEBCON6__PHR" />
         </register>
         <register caption="Leading-Edge Blanking Control Register x (x = 1 through 12)" name="LEBCON7" offset="0x780" rw="RW" size="4">
            <bitfield caption="Current-Limit Leading-Edge Blanking Enable bit" mask="0x00000400" name="CLLEBEN" values="LEBCON7__CLLEBEN" />
            <bitfield caption="Fault Input Leading-Edge Blanking Enable bit" mask="0x00000800" name="FLTLEBEN" values="LEBCON7__FLTLEBEN" />
            <bitfield caption="PWMxL Falling Edge Trigger Enable bit" mask="0x00001000" name="PLF" values="LEBCON7__PLF" />
            <bitfield caption="PWMxL Rising Edge Trigger Enable bit" mask="0x00002000" name="PLR" values="LEBCON7__PLR" />
            <bitfield caption="PWMxH Falling Edge Trigger Enable bit" mask="0x00004000" name="PHF" values="LEBCON7__PHF" />
            <bitfield caption="PWMxH Rising Edge Trigger Enable bit" mask="0x00008000" name="PHR" values="LEBCON7__PHR" />
         </register>
         <register caption="Leading-Edge Blanking Control Register x (x = 1 through 12)" name="LEBCON8" offset="0x880" rw="RW" size="4">
            <bitfield caption="Current-Limit Leading-Edge Blanking Enable bit" mask="0x00000400" name="CLLEBEN" values="LEBCON8__CLLEBEN" />
            <bitfield caption="Fault Input Leading-Edge Blanking Enable bit" mask="0x00000800" name="FLTLEBEN" values="LEBCON8__FLTLEBEN" />
            <bitfield caption="PWMxL Falling Edge Trigger Enable bit" mask="0x00001000" name="PLF" values="LEBCON8__PLF" />
            <bitfield caption="PWMxL Rising Edge Trigger Enable bit" mask="0x00002000" name="PLR" values="LEBCON8__PLR" />
            <bitfield caption="PWMxH Falling Edge Trigger Enable bit" mask="0x00004000" name="PHF" values="LEBCON8__PHF" />
            <bitfield caption="PWMxH Rising Edge Trigger Enable bit" mask="0x00008000" name="PHR" values="LEBCON8__PHR" />
         </register>
         <register caption="Leading-Edge Blanking Control Register x (x = 1 through 12)" name="LEBCON9" offset="0x980" rw="RW" size="4">
            <bitfield caption="Current-Limit Leading-Edge Blanking Enable bit" mask="0x00000400" name="CLLEBEN" values="LEBCON9__CLLEBEN" />
            <bitfield caption="Fault Input Leading-Edge Blanking Enable bit" mask="0x00000800" name="FLTLEBEN" values="LEBCON9__FLTLEBEN" />
            <bitfield caption="PWMxL Falling Edge Trigger Enable bit" mask="0x00001000" name="PLF" values="LEBCON9__PLF" />
            <bitfield caption="PWMxL Rising Edge Trigger Enable bit" mask="0x00002000" name="PLR" values="LEBCON9__PLR" />
            <bitfield caption="PWMxH Falling Edge Trigger Enable bit" mask="0x00004000" name="PHF" values="LEBCON9__PHF" />
            <bitfield caption="PWMxH Rising Edge Trigger Enable bit" mask="0x00008000" name="PHR" values="LEBCON9__PHR" />
         </register>
         <register caption="Leading-Edge Blanking Control Register x (x = 1 through 12)" name="LEBCON10" offset="0xa80" rw="RW" size="4">
            <bitfield caption="Current-Limit Leading-Edge Blanking Enable bit" mask="0x00000400" name="CLLEBEN" values="LEBCON10__CLLEBEN" />
            <bitfield caption="Fault Input Leading-Edge Blanking Enable bit" mask="0x00000800" name="FLTLEBEN" values="LEBCON10__FLTLEBEN" />
            <bitfield caption="PWMxL Falling Edge Trigger Enable bit" mask="0x00001000" name="PLF" values="LEBCON10__PLF" />
            <bitfield caption="PWMxL Rising Edge Trigger Enable bit" mask="0x00002000" name="PLR" values="LEBCON10__PLR" />
            <bitfield caption="PWMxH Falling Edge Trigger Enable bit" mask="0x00004000" name="PHF" values="LEBCON10__PHF" />
            <bitfield caption="PWMxH Rising Edge Trigger Enable bit" mask="0x00008000" name="PHR" values="LEBCON10__PHR" />
         </register>
         <register caption="Leading-Edge Blanking Control Register x (x = 1 through 12)" name="LEBCON11" offset="0xb80" rw="RW" size="4">
            <bitfield caption="Current-Limit Leading-Edge Blanking Enable bit" mask="0x00000400" name="CLLEBEN" values="LEBCON11__CLLEBEN" />
            <bitfield caption="Fault Input Leading-Edge Blanking Enable bit" mask="0x00000800" name="FLTLEBEN" values="LEBCON11__FLTLEBEN" />
            <bitfield caption="PWMxL Falling Edge Trigger Enable bit" mask="0x00001000" name="PLF" values="LEBCON11__PLF" />
            <bitfield caption="PWMxL Rising Edge Trigger Enable bit" mask="0x00002000" name="PLR" values="LEBCON11__PLR" />
            <bitfield caption="PWMxH Falling Edge Trigger Enable bit" mask="0x00004000" name="PHF" values="LEBCON11__PHF" />
            <bitfield caption="PWMxH Rising Edge Trigger Enable bit" mask="0x00008000" name="PHR" values="LEBCON11__PHR" />
         </register>
         <register caption="Leading-Edge Blanking Control Register x (x = 1 through 12)" name="LEBCON12" offset="0xc80" rw="RW" size="4">
            <bitfield caption="Current-Limit Leading-Edge Blanking Enable bit" mask="0x00000400" name="CLLEBEN" values="LEBCON12__CLLEBEN" />
            <bitfield caption="Fault Input Leading-Edge Blanking Enable bit" mask="0x00000800" name="FLTLEBEN" values="LEBCON12__FLTLEBEN" />
            <bitfield caption="PWMxL Falling Edge Trigger Enable bit" mask="0x00001000" name="PLF" values="LEBCON12__PLF" />
            <bitfield caption="PWMxL Rising Edge Trigger Enable bit" mask="0x00002000" name="PLR" values="LEBCON12__PLR" />
            <bitfield caption="PWMxH Falling Edge Trigger Enable bit" mask="0x00004000" name="PHF" values="LEBCON12__PHF" />
            <bitfield caption="PWMxH Rising Edge Trigger Enable bit" mask="0x00008000" name="PHR" values="LEBCON12__PHR" />
         </register>
         <register caption="Leading-Edge Blanking Delay Register x (x = 1 through 12)" name="LEBDLY1" offset="0x190" rw="RW" size="4">
            <bitfield mask="0x00000FFF" name="LEB" />
         </register>
         <register caption="Leading-Edge Blanking Delay Register x (x = 1 through 12)" name="LEBDLY2" offset="0x290" rw="RW" size="4">
            <bitfield mask="0x00000FFF" name="LEB" />
         </register>
         <register caption="Leading-Edge Blanking Delay Register x (x = 1 through 12)" name="LEBDLY3" offset="0x390" rw="RW" size="4">
            <bitfield mask="0x00000FFF" name="LEB" />
         </register>
