Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024MCF100.atdf
         <register caption="PWM Timer Register x (x = 1 through 12)" name="PTMR4" offset="0x4b0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="TMR" />
         </register>
         <register caption="PWM Timer Register x (x = 1 through 12)" name="PTMR5" offset="0x5b0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="TMR" />
         </register>
         <register caption="PWM Timer Register x (x = 1 through 12)" name="PTMR6" offset="0x6b0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="TMR" />
         </register>
         <register caption="PWM Timer Register x (x = 1 through 12)" name="PTMR7" offset="0x7b0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="TMR" />
         </register>
         <register caption="PWM Timer Register x (x = 1 through 12)" name="PTMR8" offset="0x8b0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="TMR" />
         </register>
         <register caption="PWM Timer Register x (x = 1 through 12)" name="PTMR9" offset="0x9b0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="TMR" />
         </register>
         <register caption="PWM Timer Register x (x = 1 through 12)" name="PTMR10" offset="0xab0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="TMR" />
         </register>
         <register caption="PWM Timer Register x (x = 1 through 12)" name="PTMR11" offset="0xbb0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="TMR" />
         </register>
         <register caption="PWM Timer Register x (x = 1 through 12)" name="PTMR12" offset="0xcb0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="TMR" />
         </register>
      </register-group>
      <value-group caption="PWM Special Event Trigger Output Postscaler Select bits" name="PTCON__SEVTPS">
         <value caption="1:16 postscaler generates Special Event trigger at every 16th compare match event" name="" value="0xf" />
         <value caption="1:2 postscaler generates Special Event trigger at every second compare match event" name="" value="0x1" />
         <value caption="1:1 postscaler generates Special Event trigger at every compare match event" name="" value="0x0" />
      </value-group>
      <value-group caption="Primary PWM Input Clock Prescaler bits" name="PTCON__PCLKDIV">
         <value caption="Divide by 128" name="" value="0x7" />
         <value caption="Divide by 64" name="" value="0x6" />
         <value caption="Divide by 32" name="" value="0x5" />
         <value caption="Divide by 16" name="" value="0x4" />
         <value caption="Divide by 8" name="" value="0x3" />
         <value caption="Divide by 4" name="" value="0x2" />
         <value caption="Divide by 2" name="" value="0x1" />
         <value caption="Divide by 1" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Module Status bit" name="PTCON__PWMRDY">
         <value caption="PWM module is ready and operation has begun" name="" value="0x1" />
         <value caption="PWM module is not ready" name="" value="0x0" />
      </value-group>
      <value-group caption="Special Event Interrupt Enable bit" name="PTCON__SEIEN">
         <value caption="Special Event Interrupt is enabled" name="" value="0x1" />
         <value caption="Special Event Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Special Event Interrupt Status bit" name="PTCON__SESTAT">
         <value caption="Special Event Interrupt is pending" name="" value="0x1" />
         <value caption="Special Event Interrupt is not pending" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Time Base Stop in Idle Mode bit" name="PTCON__PTSIDL">
         <value caption="PWM time base halts in CPU Idle mode" name="" value="0x1" />
         <value caption="PWM time base runs in CPU Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Module Enable bit" name="PTCON__PTEN">
         <value caption="PWM module is enabled" name="" value="0x1" />
         <value caption="PWM module is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Secondary Special Event Trigger Output Postscaler Select bits" name="STCON__SEVTPS">
         <value caption="1:16 Postscale" name="" value="0xf" />
         <value caption="1:2 Postscale" name="" value="0x1" />
         <value caption="1:1 Postscale" name="" value="0x0" />
      </value-group>
      <value-group caption="Secondary PWM Input Clock Prescaler" name="STCON__SCLKDIV">
         <value caption="Divide by 128" name="" value="0x7" />
         <value caption="Divide by 64" name="" value="0x6" />
         <value caption="Divide by 32" name="" value="0x5" />
         <value caption="Divide by 16" name="" value="0x4" />
         <value caption="Divide by 8" name="" value="0x3" />
         <value caption="Divide by 4" name="" value="0x2" />
         <value caption="Divide by 2" name="" value="0x1" />
         <value caption="Divide by 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Secondary Special Event Interrupt Enable bit" name="STCON__SSEIEN">
         <value caption="Secondary Special Event Interrupt is enabled" name="" value="0x1" />
         <value caption="Secondary Special Event Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Secondary Special Event Interrupt Status bit" name="STCON__SSESTAT">
         <value caption="Secondary Special Event Interrupt is pending" name="" value="0x1" />
         <value caption="Secondary Special Event Interrupt is not pending" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Chop Clock Generator bit" name="CHOP__CHPCLKEN">
         <value caption="Chop clock generator is enabled" name="" value="0x1" />
         <value caption="Chop clock generator is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="External PWM Reset Control bit" name="PWMCON1__XPRES">
         <value caption="Current-limit source resets primary local time base for this PWM generator if it is in Independent Time Base mode and the PWM module enters the deassertion portion of the duty cycle" name="" value="0x1" />
         <value caption="External pins do not affect PWM time base" name="" value="0x0" />
      </value-group>
