Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024MCF100.atdf
      <value-group caption="Dead Time Control bits" name="PWMCON12__DTC">
         <value caption="Dead Time Compensation mode enabled" name="" value="0x3" />
         <value caption="Dead time function is disabled" name="" value="0x2" />
         <value caption="Negative dead time actively applied for Complementary Output mode" name="" value="0x1" />
         <value caption="Positive dead time actively applied for all output modes" name="" value="0x0" />
      </value-group>
      <value-group caption="Independent Time Base Mode bit" name="PWMCON12__ITB">
         <value caption="PHASEx registers provide time base period for this PWM generator" name="" value="0x1" />
         <value caption="PTPER/STPER register provides timing for this PWM generator based on the MTBS bit" name="" value="0x0" />
      </value-group>
      <value-group caption="Edge/Center-Aligned Mode Enable bits" name="PWMCON12__ECAM">
         <value caption="Asymmetric Center-Aligned mode with simultaneous update (PWM(min) Duty Cycle Resolution = (1/FSYSCLK))" name="" value="0x3" />
         <value caption="Asymmetric Center-Aligned mode double update (PWM(min) Duty Cycle Resolution = (1/FSYSCLK))" name="" value="0x2" />
         <value caption="Symmetric Center-Aligned mode (PWM(min) Duty Cycle Resolution = (2/FSYSCLK))" name="" value="0x1" />
         <value caption="Edge-Aligned mode (PWM(min) Duty Cycle Resolution = (1/FSYSCLK))" name="" value="0x0" />
      </value-group>
      <value-group caption="Current-Limit Interrupt Status bit (This bit is cleared by setting CLIEN to 0)" name="PWMCON12__CLTSTAT">
         <value caption="Current-limit interrupt is pending" name="" value="0x1" />
         <value caption="No current-limit interrupt is pending" name="" value="0x0" />
      </value-group>
      <value-group caption="Fault Interrupt Status bit (This bit is cleared by setting FLTIEN to 0)" name="PWMCON12__FLTSTAT">
         <value caption="Fault interrupt is pending" name="" value="0x1" />
         <value caption="No fault interrupt is pending" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM High Phase Interrupt Enable bit" name="PWMCON12__PWMHIEN">
         <value caption="When the PWM Period matches the value in the PWM timer" name="" value="0x1" />
         <value caption="PWM Period event interrupt request is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Low Phase Interrupt Enable bit" name="PWMCON12__PWMLIEN">
         <value caption="When the PWM Timer is equal to 0x4" name="" value="0x1" />
         <value caption="PWM Period event interrupt request is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Current-Limit Interrupt Enable bit" name="PWMCON12__CLIEN">
         <value caption="Current-limit interrupt is enabled. If CLIF is 1" name="" value="0x1" />
         <value caption="Current-limit interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Fault Interrupt Enable bit" name="PWMCON12__FLTIEN">
         <value caption="Fault interrupt is enabled. If FLTIF is 1" name="" value="0x1" />
         <value caption="Fault interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMH Interrupt Status bit" name="PWMCON12__PWMHIF">
         <value caption="PWM period match interrupt has occurred" name="" value="0x1" />
         <value caption="PWM period match interrupt has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="PWML Interrupt Status bit" name="PWMCON12__PWMLIF">
         <value caption="PWM Timer equal to 0x0 interrupt has occurred" name="" value="0x1" />
         <value caption="PWM Interrupt has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Interrupt Status bit" name="PWMCON12__TRGIF">
         <value caption="Trigger interrupt is pending" name="" value="0x1" />
         <value caption="Trigger interrupt is not pending" name="" value="0x0" />
      </value-group>
      <value-group caption="Current-Limit Status bit" name="PWMCON12__CLIF">
         <value caption="Current limit has occurred" name="" value="0x1" />
         <value caption="Current limit has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Fault Interrupt Flag bit" name="PWMCON12__FLTIF">
         <value caption="Fault interrupt has occurred" name="" value="0x1" />
         <value caption="Fault interrupt has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Override Synchronization bit" name="IOCON1__OSYNC">
         <value caption="Output overrides through the OVRDAT bits are synchronized to the PWM time base" name="" value="0x1" />
         <value caption="Output overrides through the OVRDAT bits occur on next CPU clock boundary" name="" value="0x0" />
      </value-group>
      <value-group caption="SWAP PWMxH and PWMxL Pins bit" name="IOCON1__SWAP">
         <value caption="PWMxH output signal is connected to PWMxL pin; PWMxL output signal is connected to PWMxH pin" name="" value="0x1" />
         <value caption="PWMxH and PWMxL output signals pins are mapped to their respective pins" name="" value="0x0" />
      </value-group>
      <value-group caption="State for PWMxH" name="IOCON1__OVRDAT">
         <value caption="1" name="" value="If OVRENH" />
         <value caption="1" name="" value="If OVRENL" />
      </value-group>
      <value-group caption="Override Enable for PWMxL Pin bit" name="IOCON1__OVRENL">
         <value caption="OVRDAT provides data for output on PWMxL pin" name="" value="0x1" />
         <value caption="PWM generator provides data for PWMxL pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Override Enable for PWMxH Pin bit" name="IOCON1__OVRENH">
         <value caption="OVRDAT provides data for output on PWMxH pin" name="" value="0x1" />
         <value caption="PWM generator provides data for PWMxH pin" name="" value="0x0" />
      </value-group>
