Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024MCF100.atdf
      <value-group caption="Secondary Trigger Cycle Selection bits for Dual Cycle PWM Cycles" name="TRGCON10__STRGSEL">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="When a secondary PWM trigger comparison match event occurs in the second half of a dual cycle PWM mode (PTDIR is 0)" name="" value="0x2" />
         <value caption="When a secondary PWM trigger comparison match event occurs in the first half of a dual cycle PWM mode (PTDIR is 1)" name="" value="0x1" />
         <value caption="When a secondary PWM trigger comparison match event occurs" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Cycle Selection for Dual Cycle PWM Cycles" name="TRGCON10__TRGSEL">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="When a trigger comparison match event occurs in the incrementing phase in the dual cycle PWM mode (PTDIR is 0)" name="" value="0x2" />
         <value caption="When a trigger comparison match event occurs in the decrementing phase in the dual cycle PWM mode (PTDIR is 1)" name="" value="0x1" />
         <value caption="When a trigger comparison match event occurs" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger x Output Divider bits" name="TRGCON10__TRGDIV">
         <value caption="Trigger output for every sixteenth trigger event" name="" value="0xf" />
         <value caption="Trigger output for every third trigger event" name="" value="0x2" />
         <value caption="Trigger output for every second trigger event" name="" value="0x1" />
         <value caption="Trigger output for every trigger event" name="" value="0x0" />
      </value-group>
      <value-group caption="Secondary Trigger Interrupt Select" name="TRGCON11__STRGIS">
         <value caption="Selects the Secondary Trigger Register (STRIGx) based events for interrupts" name="" value="0x1" />
         <value caption="(When the DTM bit (TRGCONx) is clear (is 0)) TRIGx-based events for interrupts are selected / (When the DTM bit is set (= 1))the logical OR of both STRIGx and TRIGx based triggers for interrupts are selected." name="" value="0x0" />
      </value-group>
      <value-group caption="Dual ADC Trigger Mode" name="TRGCON11__DTM">
         <value caption="Secondary trigger event is combined with the primary trigger event for purposes of creating a combined ADC trigger" name="" value="0x1" />
         <value caption="Secondary trigger event is not combined with the primary trigger event for purposes of creating a combined ADC trigger" name="" value="0x0" />
      </value-group>
      <value-group caption="Secondary Trigger Cycle Selection bits for Dual Cycle PWM Cycles" name="TRGCON11__STRGSEL">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="When a secondary PWM trigger comparison match event occurs in the second half of a dual cycle PWM mode (PTDIR is 0)" name="" value="0x2" />
         <value caption="When a secondary PWM trigger comparison match event occurs in the first half of a dual cycle PWM mode (PTDIR is 1)" name="" value="0x1" />
         <value caption="When a secondary PWM trigger comparison match event occurs" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Cycle Selection for Dual Cycle PWM Cycles" name="TRGCON11__TRGSEL">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="When a trigger comparison match event occurs in the incrementing phase in the dual cycle PWM mode (PTDIR is 0)" name="" value="0x2" />
         <value caption="When a trigger comparison match event occurs in the decrementing phase in the dual cycle PWM mode (PTDIR is 1)" name="" value="0x1" />
         <value caption="When a trigger comparison match event occurs" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger x Output Divider bits" name="TRGCON11__TRGDIV">
         <value caption="Trigger output for every sixteenth trigger event" name="" value="0xf" />
         <value caption="Trigger output for every third trigger event" name="" value="0x2" />
         <value caption="Trigger output for every second trigger event" name="" value="0x1" />
         <value caption="Trigger output for every trigger event" name="" value="0x0" />
      </value-group>
      <value-group caption="Secondary Trigger Interrupt Select" name="TRGCON12__STRGIS">
         <value caption="Selects the Secondary Trigger Register (STRIGx) based events for interrupts" name="" value="0x1" />
         <value caption="(When the DTM bit (TRGCONx) is clear (is 0)) TRIGx-based events for interrupts are selected / (When the DTM bit is set (= 1))the logical OR of both STRIGx and TRIGx based triggers for interrupts are selected." name="" value="0x0" />
      </value-group>
      <value-group caption="Dual ADC Trigger Mode" name="TRGCON12__DTM">
         <value caption="Secondary trigger event is combined with the primary trigger event for purposes of creating a combined ADC trigger" name="" value="0x1" />
         <value caption="Secondary trigger event is not combined with the primary trigger event for purposes of creating a combined ADC trigger" name="" value="0x0" />
      </value-group>
      <value-group caption="Secondary Trigger Cycle Selection bits for Dual Cycle PWM Cycles" name="TRGCON12__STRGSEL">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="When a secondary PWM trigger comparison match event occurs in the second half of a dual cycle PWM mode (PTDIR is 0)" name="" value="0x2" />
         <value caption="When a secondary PWM trigger comparison match event occurs in the first half of a dual cycle PWM mode (PTDIR is 1)" name="" value="0x1" />
         <value caption="When a secondary PWM trigger comparison match event occurs" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Cycle Selection for Dual Cycle PWM Cycles" name="TRGCON12__TRGSEL">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="When a trigger comparison match event occurs in the incrementing phase in the dual cycle PWM mode (PTDIR is 0)" name="" value="0x2" />
         <value caption="When a trigger comparison match event occurs in the decrementing phase in the dual cycle PWM mode (PTDIR is 1)" name="" value="0x1" />
         <value caption="When a trigger comparison match event occurs" name="" value="0x0" />
      </value-group>
