Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024MCF100.atdf
      <value-group caption="Trigger x Output Divider bits" name="TRGCON12__TRGDIV">
         <value caption="Trigger output for every sixteenth trigger event" name="" value="0xf" />
         <value caption="Trigger output for every third trigger event" name="" value="0x2" />
         <value caption="Trigger output for every second trigger event" name="" value="0x1" />
         <value caption="Trigger output for every trigger event" name="" value="0x0" />
      </value-group>
      <value-group caption="Current-Limit Leading-Edge Blanking Enable bit" name="LEBCON1__CLLEBEN">
         <value caption="Leading-Edge Blanking is applied to selected current-limit input" name="" value="0x1" />
         <value caption="Leading-Edge Blanking is not applied to selected current-limit input" name="" value="0x0" />
      </value-group>
      <value-group caption="Fault Input Leading-Edge Blanking Enable bit" name="LEBCON1__FLTLEBEN">
         <value caption="Leading-Edge Blanking is applied to selected fault input" name="" value="0x1" />
         <value caption="Leading-Edge Blanking is not applied to selected fault input" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxL Falling Edge Trigger Enable bit" name="LEBCON1__PLF">
         <value caption="Falling edge of PWMxL will trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x1" />
         <value caption="Falling edge of PWMxL will not trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxL Rising Edge Trigger Enable bit" name="LEBCON1__PLR">
         <value caption="Rising edge of PWMxL will trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x1" />
         <value caption="Rising edge of PWMxL will not trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Falling Edge Trigger Enable bit" name="LEBCON1__PHF">
         <value caption="Falling edge of PWMxH will trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x1" />
         <value caption="Falling edge of PWMxH will not trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Rising Edge Trigger Enable bit" name="LEBCON1__PHR">
         <value caption="Rising edge of PWMxH will trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x1" />
         <value caption="Rising edge of PWMxH will not trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x0" />
      </value-group>
      <value-group caption="Current-Limit Leading-Edge Blanking Enable bit" name="LEBCON2__CLLEBEN">
         <value caption="Leading-Edge Blanking is applied to selected current-limit input" name="" value="0x1" />
         <value caption="Leading-Edge Blanking is not applied to selected current-limit input" name="" value="0x0" />
      </value-group>
      <value-group caption="Fault Input Leading-Edge Blanking Enable bit" name="LEBCON2__FLTLEBEN">
         <value caption="Leading-Edge Blanking is applied to selected fault input" name="" value="0x1" />
         <value caption="Leading-Edge Blanking is not applied to selected fault input" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxL Falling Edge Trigger Enable bit" name="LEBCON2__PLF">
         <value caption="Falling edge of PWMxL will trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x1" />
         <value caption="Falling edge of PWMxL will not trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxL Rising Edge Trigger Enable bit" name="LEBCON2__PLR">
         <value caption="Rising edge of PWMxL will trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x1" />
         <value caption="Rising edge of PWMxL will not trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Falling Edge Trigger Enable bit" name="LEBCON2__PHF">
         <value caption="Falling edge of PWMxH will trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x1" />
         <value caption="Falling edge of PWMxH will not trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Rising Edge Trigger Enable bit" name="LEBCON2__PHR">
         <value caption="Rising edge of PWMxH will trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x1" />
         <value caption="Rising edge of PWMxH will not trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x0" />
      </value-group>
      <value-group caption="Current-Limit Leading-Edge Blanking Enable bit" name="LEBCON3__CLLEBEN">
         <value caption="Leading-Edge Blanking is applied to selected current-limit input" name="" value="0x1" />
         <value caption="Leading-Edge Blanking is not applied to selected current-limit input" name="" value="0x0" />
      </value-group>
      <value-group caption="Fault Input Leading-Edge Blanking Enable bit" name="LEBCON3__FLTLEBEN">
         <value caption="Leading-Edge Blanking is applied to selected fault input" name="" value="0x1" />
         <value caption="Leading-Edge Blanking is not applied to selected fault input" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxL Falling Edge Trigger Enable bit" name="LEBCON3__PLF">
         <value caption="Falling edge of PWMxL will trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x1" />
         <value caption="Falling edge of PWMxL will not trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxL Rising Edge Trigger Enable bit" name="LEBCON3__PLR">
         <value caption="Rising edge of PWMxL will trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x1" />
         <value caption="Rising edge of PWMxL will not trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Falling Edge Trigger Enable bit" name="LEBCON3__PHF">
         <value caption="Falling edge of PWMxH will trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x1" />
         <value caption="Falling edge of PWMxH will not trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x0" />
      </value-group>
