Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024MCF100.atdf
      <value-group caption="Write Strobe Polarity bit" name="PMCON__WRSP">
         <value caption="(Slave and Master mode 2) Write strobe active-high / (Master mode 1) Enable strobe active-high" name="" value="0x1" />
         <value caption="(Slave and Master mode 2) Write strobe active-low / (Master mode 1) Enable strobe active-low" name="" value="0x0" />
      </value-group>
      <value-group caption="Chip Select 1 Polarity bit" name="PMCON__CS1P">
         <value caption="Active-high (PMCS1)" name="" value="0x1" />
         <value caption="Active-low (PMCS1)" name="" value="0x0" />
      </value-group>
      <value-group caption="Chip Select 2 Polarity bit" name="PMCON__CS2P">
         <value caption="Active-high (PMCS2)" name="" value="0x1" />
         <value caption="Active-low (PMCS2)" name="" value="0x0" />
      </value-group>
      <value-group caption="Address Latch Polarity bit" name="PMCON__ALP">
         <value caption="Active-high (PMALL and PMALH)" name="" value="0x1" />
         <value caption="Active-low (PMALL and PMALH)" name="" value="0x0" />
      </value-group>
      <value-group caption="Chip Select Function bits" name="PMCON__CSF">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="PMCS1 and PMCS2 function as Chip Select" name="" value="0x2" />
         <value caption="PMCS2 functions as Chip Select and PMCS1 functions as address bit 14" name="" value="0x1" />
         <value caption="PMCS1 and PMCS2 function as address bit 14 and address bit 15" name="" value="0x0" />
      </value-group>
      <value-group caption="Read/Write Strobe Port Enable bit" name="PMCON__PTRDEN">
         <value caption="PMRD/PMWR port is enabled" name="" value="0x1" />
         <value caption="PMRD/PMWR port is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Write Enable Strobe Port Enable bit" name="PMCON__PTWREN">
         <value caption="PMWR/PMENB port is enabled" name="" value="0x1" />
         <value caption="PMWR/PMENB port is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PMP Module TTL Input Buffer Select bit" name="PMCON__PMPTTL">
         <value caption="PMP module uses TTL input buffers" name="" value="0x1" />
         <value caption="PMP module uses Schmitt Trigger input buffer" name="" value="0x0" />
      </value-group>
      <value-group caption="Address/Data Multiplexing Selection bits" name="PMCON__ADRMUX">
         <value caption="Lower 8 bits of address are multiplexed on PMD pins; upper 8 bits are not used" name="" value="0x3" />
         <value caption="All 16 bits of address are multiplexed on PMD pins" name="" value="0x2" />
         <value caption="Lower 8 bits of address are multiplexed on PMD pins" name="" value="0x1" />
         <value caption="Address and data appear on separate pins" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="PMCON__SIDL">
         <value caption="Discontinue module operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue module operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Parallel Master Port Enable bit" name="PMCON__ON">
         <value caption="PMP is enabled" name="" value="0x1" />
         <value caption="PMP is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Dual Read/Write Buffers enable bit" name="PMCON__DUALBUF">
         <value caption="PMP uses separate registers for reads and writes (PMRADDR" name="" value="0x1" />
         <value caption="PMP uses legacy registers (PMADDR" name="" value="0x0" />
      </value-group>
      <value-group caption="Start Read on PMP Bus bit" name="PMCON__RDSTART">
         <value caption="Start a read cycle on the PMP bus" name="" value="0x20" />
         <value caption="No effect" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Hold After Read/Write Strobe Wait States bits" name="PMMODE__WAITE">
         <value caption="(for writes) Wait of 4 Tpbclk2 / (for reads) Wait of 3 Tpbclk2" name="" value="0x3" />
         <value caption="(for writes) Wait of 3 Tpbclk2 / (for reads) Wait of 2 Tpbclk2" name="" value="0x2" />
         <value caption="(for writes) Wait of 2 Tpbclk2 / (for reads) Wait of 1 Tpbclk2" name="" value="0x1" />
         <value caption="(for writes) Wait of 1 Tpbclk2 (default) / (for reads) Wait of 0 Tpbclk2 (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Read/Write Strobe Wait States bits" name="PMMODE__WAITM">
         <value caption="Wait of 16 Tpbclk2" name="" value="0xf" />
         <value caption="Wait of 2 Tpbclk2" name="" value="0x1" />
         <value caption="Wait of 1 Tpbclk2 (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Setup to Read/Write Strobe Wait States bits" name="PMMODE__WAITB">
         <value caption="Data wait of 4 Tpbclk2" name="" value="0x3" />
         <value caption="Data wait of 3 Tpbclk2" name="" value="0x2" />
         <value caption="Data wait of 2 Tpbclk2" name="" value="0x1" />
         <value caption="Data wait of 1 Tpbclk2" name="" value="0x0" />
      </value-group>
      <value-group caption="8/16-bit Mode bit" name="PMMODE__MODE16">
         <value caption="16-bit mode: a read or write to the data register invokes a single 16-bit transfer" name="" value="0x1" />
         <value caption="8-bit mode: a read or write to the data register invokes a single 8-bit transfer" name="" value="0x0" />
      </value-group>
      <value-group caption="Increment Mode bits" name="PMMODE__INCM">
         <value caption="Slave mode read and write buffers auto-increment (MODE = 00 only)" name="" value="0x3" />
         <value caption="Decrement ADDR and ADDR&lt;14&gt; by 1 every read/write cycle" name="" value="0x2" />
         <value caption="Increment ADDR and ADDR&lt;14&gt; by 1 every read/write cycle" name="" value="0x1" />
         <value caption="No increment or decrement of address" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt Request Mode bits" name="PMMODE__IRQM">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Interrupt is generated when Read Buffer 3 is read or Write Buffer 3 is written (Buffered PSP mode)or on a read or write operation when PMA = 11 (Addressable Slave mode only)" name="" value="0x2" />
         <value caption="Interrupt is generated at the end of the read/write cycle" name="" value="0x1" />
         <value caption="No Interrupt is generated" name="" value="0x0" />
      </value-group>
      <value-group caption="Busy bit" name="PMMODE__BUSY">
         <value caption="Port is busy" name="" value="0x1" />
         <value caption="Port is not busy" name="" value="0x0" />
      </value-group>
      <value-group caption="Chip Select 1 bit" name="PMADDR__CS1">
         <value caption="Chip Select 1 is active" name="" value="0x4000" />
         <value caption="Chip Select 1 is inactive" name="" value="0x0" />
      </value-group>
      <value-group caption="Chip Select 2 bit" name="PMADDR__CS2">
         <value caption="Chip Select 2 is active" name="" value="0x8000" />
         <value caption="Chip Select 2 is inactive" name="" value="0x0" />
      </value-group>
      <value-group caption="PMALH/PMALL Strobe Enable bits" name="PMAEN__PTEN">
         <value caption="PMA15 and PMA14 function as either PMA or PMCS1 and PMCS2" name="" value="0x4000" />
         <value caption="PMA15 and PMA14 function as port I/O" name="" value="0x0" />
         <value caption="PMA function as PMP address lines" name="" value="0x4" />
         <value caption="PMA function as port I/O" name="" value="0x0" />
         <value caption="PMA1 and PMA0 function as either PMA or PMALH and PMALL" name="" value="0x1" />
         <value caption="PMA1 and PMA0 pads function as port I/O" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Buffer 0 Status Empty bit" name="PMSTAT__OB0E">
         <value caption="Output buffer is empty (writing data to the buffer will clear this bit)" name="" value="0x1" />
         <value caption="Output buffer contains data that has not been transmitted" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Buffer 1 Status Empty bit" name="PMSTAT__OB1E">
         <value caption="Output buffer is empty (writing data to the buffer will clear this bit)" name="" value="0x1" />
         <value caption="Output buffer contains data that has not been transmitted" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Buffer 2 Status Empty bit" name="PMSTAT__OB2E">
         <value caption="Output buffer is empty (writing data to the buffer will clear this bit)" name="" value="0x1" />
         <value caption="Output buffer contains data that has not been transmitted" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Buffer 3 Status Empty bit" name="PMSTAT__OB3E">
         <value caption="Output buffer is empty (writing data to the buffer will clear this bit)" name="" value="0x1" />
         <value caption="Output buffer contains data that has not been transmitted" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Buffer Underflow Status bit" name="PMSTAT__OBUF">
         <value caption="A read occurred from an empty output byte buffer (must be cleared in software)" name="" value="0x1" />
         <value caption="No underflow is occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Buffer Empty Status bit" name="PMSTAT__OBE">
         <value caption="All readable output buffer registers are empty" name="" value="0x1" />
         <value caption="Some or all of the readable output buffer registers are full" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Buffer 0 Status Full bit" name="PMSTAT__IB0F">
         <value caption="Input Buffer contains data that has not been read (reading buffer will clear this bit)" name="" value="0x1" />
         <value caption="Input Buffer does not contain any unread data" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Buffer 1 Status Full bit" name="PMSTAT__IB1F">
         <value caption="Input Buffer contains data that has not been read (reading buffer will clear this bit)" name="" value="0x1" />
         <value caption="Input Buffer does not contain any unread data" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Buffer 2 Status Full bit" name="PMSTAT__IB2F">
         <value caption="Input Buffer contains data that has not been read (reading buffer will clear this bit)" name="" value="0x1" />
         <value caption="Input Buffer does not contain any unread data" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Buffer 3 Status Full bit" name="PMSTAT__IB3F">
         <value caption="Input Buffer contains data that has not been read (reading buffer will clear this bit)" name="" value="0x1" />
         <value caption="Input Buffer does not contain any unread data" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Buffer Overflow Status bit" name="PMSTAT__IBOV">
         <value caption="A write attempt to a full input byte buffer is occurred (must be cleared in software)" name="" value="0x1" />
         <value caption="No overflow is occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Buffer Full Status bit" name="PMSTAT__IBF">
         <value caption="All writable input buffer registers are full" name="" value="0x1" />
         <value caption="Some or all of the writable input buffer registers are empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Chip Select 1 bit" name="PMWADDR__WCS1">
         <value caption="Chip Select 1 is active" name="" value="0x4000" />
         <value caption="Chip Select 1 is inactive" name="" value="0x0" />
      </value-group>
      <value-group caption="Chip Select 2 bit" name="PMWADDR__WCS2">
         <value caption="Chip Select 2 is active" name="" value="0x8000" />
         <value caption="Chip Select 2 is inactive" name="" value="0x0" />
      </value-group>
      <value-group caption="Chip Select 1 bit" name="PMRADDR__RCS1">
         <value caption="Chip Select 1 is active" name="" value="0x4000" />
         <value caption="Chip Select 1 is inactive (RADDR14 function is selected)" name="" value="0x0" />
      </value-group>
      <value-group caption="Chip Select 2 bit" name="PMRADDR__RCS2">
         <value caption="Chip Select 2 is active" name="" value="0x8000" />
         <value caption="Chip Select 2 is inactive (RADDR15 function is selected)" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01494" name="QEI" version="1">
      <register-group name="QEI">
         <register caption="QEIx Control Register" name="QEI1CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Counter Control Mode Selection bits" mask="0x00000003" name="CCM" values="QEI1CON__CCM" />
            <bitfield caption="External Count Gate Enable bit" mask="0x00000004" name="GATEN" values="QEI1CON__GATEN" />
            <bitfield caption="Position and Index Counter/Timer Direction Select bit" mask="0x00000008" name="CNTPOL" values="QEI1CON__CNTPOL" />
            <bitfield caption="Timer Input Clock Prescale Select bits " mask="0x00000070" name="INTDIV" values="QEI1CON__INTDIV" />
            <bitfield caption="Index Match Value bits" mask="0x00000300" name="IMV" values="QEI1CON__IMV" />
            <bitfield caption="Position Counter Initialization Mode Select bits" mask="0x00001C00" name="PIMOD" values="QEI1CON__PIMOD" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="QEISIDL" values="QEI1CON__QEISIDL" />
            <bitfield caption="Quadrature Encoder Interface Module Counter Enable bit" mask="0x00008000" name="QEIEN" values="QEI1CON__QEIEN" />
         </register>
         <register caption="QEIx Control Register" name="QEI2CON" offset="0x200" rw="RW" size="4">
            <bitfield caption="Counter Control Mode Selection bits" mask="0x00000003" name="CCM" values="QEI2CON__CCM" />
            <bitfield caption="External Count Gate Enable bit" mask="0x00000004" name="GATEN" values="QEI2CON__GATEN" />
            <bitfield caption="Position and Index Counter/Timer Direction Select bit" mask="0x00000008" name="CNTPOL" values="QEI2CON__CNTPOL" />
            <bitfield caption="Timer Input Clock Prescale Select bits " mask="0x00000070" name="INTDIV" values="QEI2CON__INTDIV" />
            <bitfield caption="Index Match Value bits" mask="0x00000300" name="IMV" values="QEI2CON__IMV" />
            <bitfield caption="Position Counter Initialization Mode Select bits" mask="0x00001C00" name="PIMOD" values="QEI2CON__PIMOD" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="QEISIDL" values="QEI2CON__QEISIDL" />
            <bitfield caption="Quadrature Encoder Interface Module Counter Enable bit" mask="0x00008000" name="QEIEN" values="QEI2CON__QEIEN" />
         </register>
         <register caption="QEIx Control Register" name="QEI3CON" offset="0x400" rw="RW" size="4">
            <bitfield caption="Counter Control Mode Selection bits" mask="0x00000003" name="CCM" values="QEI3CON__CCM" />
            <bitfield caption="External Count Gate Enable bit" mask="0x00000004" name="GATEN" values="QEI3CON__GATEN" />
            <bitfield caption="Position and Index Counter/Timer Direction Select bit" mask="0x00000008" name="CNTPOL" values="QEI3CON__CNTPOL" />
            <bitfield caption="Timer Input Clock Prescale Select bits " mask="0x00000070" name="INTDIV" values="QEI3CON__INTDIV" />
            <bitfield caption="Index Match Value bits" mask="0x00000300" name="IMV" values="QEI3CON__IMV" />
            <bitfield caption="Position Counter Initialization Mode Select bits" mask="0x00001C00" name="PIMOD" values="QEI3CON__PIMOD" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="QEISIDL" values="QEI3CON__QEISIDL" />
            <bitfield caption="Quadrature Encoder Interface Module Counter Enable bit" mask="0x00008000" name="QEIEN" values="QEI3CON__QEIEN" />
         </register>
         <register caption="QEIx Control Register" name="QEI4CON" offset="0x600" rw="RW" size="4">
            <bitfield caption="Counter Control Mode Selection bits" mask="0x00000003" name="CCM" values="QEI4CON__CCM" />
            <bitfield caption="External Count Gate Enable bit" mask="0x00000004" name="GATEN" values="QEI4CON__GATEN" />
            <bitfield caption="Position and Index Counter/Timer Direction Select bit" mask="0x00000008" name="CNTPOL" values="QEI4CON__CNTPOL" />
            <bitfield caption="Timer Input Clock Prescale Select bits " mask="0x00000070" name="INTDIV" values="QEI4CON__INTDIV" />
            <bitfield caption="Index Match Value bits" mask="0x00000300" name="IMV" values="QEI4CON__IMV" />
            <bitfield caption="Position Counter Initialization Mode Select bits" mask="0x00001C00" name="PIMOD" values="QEI4CON__PIMOD" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="QEISIDL" values="QEI4CON__QEISIDL" />
            <bitfield caption="Quadrature Encoder Interface Module Counter Enable bit" mask="0x00008000" name="QEIEN" values="QEI4CON__QEIEN" />
         </register>
         <register caption="QEIx Control Register" name="QEI5CON" offset="0x800" rw="RW" size="4">
            <bitfield caption="Counter Control Mode Selection bits" mask="0x00000003" name="CCM" values="QEI5CON__CCM" />
            <bitfield caption="External Count Gate Enable bit" mask="0x00000004" name="GATEN" values="QEI5CON__GATEN" />
            <bitfield caption="Position and Index Counter/Timer Direction Select bit" mask="0x00000008" name="CNTPOL" values="QEI5CON__CNTPOL" />
            <bitfield caption="Timer Input Clock Prescale Select bits " mask="0x00000070" name="INTDIV" values="QEI5CON__INTDIV" />
            <bitfield caption="Index Match Value bits" mask="0x00000300" name="IMV" values="QEI5CON__IMV" />
            <bitfield caption="Position Counter Initialization Mode Select bits" mask="0x00001C00" name="PIMOD" values="QEI5CON__PIMOD" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="QEISIDL" values="QEI5CON__QEISIDL" />
            <bitfield caption="Quadrature Encoder Interface Module Counter Enable bit" mask="0x00008000" name="QEIEN" values="QEI5CON__QEIEN" />
         </register>
         <register caption="QEIx Control Register" name="QEI6CON" offset="0xa00" rw="RW" size="4">
            <bitfield caption="Counter Control Mode Selection bits" mask="0x00000003" name="CCM" values="QEI6CON__CCM" />
            <bitfield caption="External Count Gate Enable bit" mask="0x00000004" name="GATEN" values="QEI6CON__GATEN" />
            <bitfield caption="Position and Index Counter/Timer Direction Select bit" mask="0x00000008" name="CNTPOL" values="QEI6CON__CNTPOL" />
            <bitfield caption="Timer Input Clock Prescale Select bits " mask="0x00000070" name="INTDIV" values="QEI6CON__INTDIV" />
            <bitfield caption="Index Match Value bits" mask="0x00000300" name="IMV" values="QEI6CON__IMV" />
            <bitfield caption="Position Counter Initialization Mode Select bits" mask="0x00001C00" name="PIMOD" values="QEI6CON__PIMOD" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="QEISIDL" values="QEI6CON__QEISIDL" />
            <bitfield caption="Quadrature Encoder Interface Module Counter Enable bit" mask="0x00008000" name="QEIEN" values="QEI6CON__QEIEN" />
         </register>
