Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024MCF100.atdf
         <register caption="QEIx I/O Control Register" name="QEI5IOC" offset="0x810" rw="RW" size="4">
            <bitfield caption="Status of QEAx Input Pin after Polarity Control and SWPAB Pin Swapping bit" mask="0x00000001" name="QEA" values="QEI5IOC__QEA" />
            <bitfield caption="Status of QEBx Input Pin after Polarity Control and SWPAB Pin Swapping bit" mask="0x00000002" name="QEB" values="QEI5IOC__QEB" />
            <bitfield caption="Status of INDXx Input Pin after Polarity Control bit" mask="0x00000004" name="INDEX" values="QEI5IOC__INDEX" />
            <bitfield caption="Status of HOMEx Input Pin after Polarity Control bit" mask="0x00000008" name="HOME" values="QEI5IOC__HOME" />
            <bitfield caption="QEAx Input Polarity Select bit" mask="0x00000010" name="QEAPOL" values="QEI5IOC__QEAPOL" />
            <bitfield caption="QEBx Input Polarity Select bit" mask="0x00000020" name="QEBPOL" values="QEI5IOC__QEBPOL" />
            <bitfield caption="INDXx Input Polarity Select bit" mask="0x00000040" name="IDXPOL" values="QEI5IOC__IDXPOL" />
            <bitfield caption="HOMEx Input Polarity Select bit" mask="0x00000080" name="HOMPOL" values="QEI5IOC__HOMPOL" />
            <bitfield caption="Swap QEA and QEB Inputs bit" mask="0x00000100" name="SWPAB" values="QEI5IOC__SWPAB" />
            <bitfield caption="QEI Module Output Function Mode Select bits" mask="0x00000600" name="OUTFNC" values="QEI5IOC__OUTFNC" />
            <bitfield caption="QEA/QEB/INDX/HOMEx Digital Input Filter Clock Divide Select bits" mask="0x00003800" name="QFDIV" values="QEI5IOC__QFDIV" />
            <bitfield caption="QEA/QEB/INDX/HOMEx Digital Filter Enable bit" mask="0x00004000" name="FLTREN" values="QEI5IOC__FLTREN" />
            <bitfield caption="Position Counter Input Capture Enable bit" mask="0x00008000" name="QCAPEN" values="QEI5IOC__QCAPEN" />
            <bitfield caption="Position Counter Input Capture by Home Event Enable bit" mask="0x00010000" name="HCAPEN" values="QEI5IOC__HCAPEN" />
         </register>
         <register caption="QEIx I/O Control Register" name="QEI6IOC" offset="0xa10" rw="RW" size="4">
            <bitfield caption="Status of QEAx Input Pin after Polarity Control and SWPAB Pin Swapping bit" mask="0x00000001" name="QEA" values="QEI6IOC__QEA" />
            <bitfield caption="Status of QEBx Input Pin after Polarity Control and SWPAB Pin Swapping bit" mask="0x00000002" name="QEB" values="QEI6IOC__QEB" />
            <bitfield caption="Status of INDXx Input Pin after Polarity Control bit" mask="0x00000004" name="INDEX" values="QEI6IOC__INDEX" />
            <bitfield caption="Status of HOMEx Input Pin after Polarity Control bit" mask="0x00000008" name="HOME" values="QEI6IOC__HOME" />
            <bitfield caption="QEAx Input Polarity Select bit" mask="0x00000010" name="QEAPOL" values="QEI6IOC__QEAPOL" />
            <bitfield caption="QEBx Input Polarity Select bit" mask="0x00000020" name="QEBPOL" values="QEI6IOC__QEBPOL" />
            <bitfield caption="INDXx Input Polarity Select bit" mask="0x00000040" name="IDXPOL" values="QEI6IOC__IDXPOL" />
            <bitfield caption="HOMEx Input Polarity Select bit" mask="0x00000080" name="HOMPOL" values="QEI6IOC__HOMPOL" />
            <bitfield caption="Swap QEA and QEB Inputs bit" mask="0x00000100" name="SWPAB" values="QEI6IOC__SWPAB" />
            <bitfield caption="QEI Module Output Function Mode Select bits" mask="0x00000600" name="OUTFNC" values="QEI6IOC__OUTFNC" />
            <bitfield caption="QEA/QEB/INDX/HOMEx Digital Input Filter Clock Divide Select bits" mask="0x00003800" name="QFDIV" values="QEI6IOC__QFDIV" />
            <bitfield caption="QEA/QEB/INDX/HOMEx Digital Filter Enable bit" mask="0x00004000" name="FLTREN" values="QEI6IOC__FLTREN" />
            <bitfield caption="Position Counter Input Capture Enable bit" mask="0x00008000" name="QCAPEN" values="QEI6IOC__QCAPEN" />
            <bitfield caption="Position Counter Input Capture by Home Event Enable bit" mask="0x00010000" name="HCAPEN" values="QEI6IOC__HCAPEN" />
         </register>
         <register caption="QEIx Status Register" name="QEI1STAT" offset="0x20" rw="RW" size="4">
            <bitfield caption="Index Input Event Interrupt Enable bit" mask="0x00000001" name="IDXIEN" values="QEI1STAT__IDXIEN" />
            <bitfield caption="Status Flag for Index Event Status bit" mask="0x00000002" name="IDXIRQ" values="QEI1STAT__IDXIRQ" />
            <bitfield caption="Home Input Event Interrupt Enable bit" mask="0x00000004" name="HOMIEN" values="QEI1STAT__HOMIEN" />
            <bitfield caption="Status Flag for Home Event Status bit" mask="0x00000008" name="HOMIRQ" values="QEI1STAT__HOMIRQ" />
            <bitfield caption="Velocity Counter Overflow Interrupt Enable bit" mask="0x00000010" name="VELOVIEN" values="QEI1STAT__VELOVIEN" />
            <bitfield caption="Velocity Counter Overflow Status bit" mask="0x00000020" name="VELOVIRQ" values="QEI1STAT__VELOVIRQ" />
            <bitfield caption="Position Counter Initialization Process Complete Interrupt Enable bit" mask="0x00000040" name="PCIIEN" values="QEI1STAT__PCIIEN" />
            <bitfield caption="Position Counter Initialization Process Complete Status bit " mask="0x00000080" name="PCIIRQ" values="QEI1STAT__PCIIRQ" />
            <bitfield caption="Position Counter Overflow Interrupt Enable bit" mask="0x00000100" name="POSOVIEN" values="QEI1STAT__POSOVIEN" />
            <bitfield caption="Position Counter Overflow Status bit" mask="0x00000200" name="POSOVIRQ" values="QEI1STAT__POSOVIRQ" />
            <bitfield caption="Position Counter Less Than or Equal Compare Interrupt Enable bit" mask="0x00000400" name="PCLEQIEN" values="QEI1STAT__PCLEQIEN" />
            <bitfield caption="Position Counter Less Than or Equal Compare Status bit" mask="0x00000800" name="PCLEQIRQ" values="QEI1STAT__PCLEQIRQ" />
            <bitfield caption="Position Counter Greater Than or Equal Compare Interrupt Enable bit" mask="0x00001000" name="PCHEQIEN" values="QEI1STAT__PCHEQIEN" />
            <bitfield caption="Position Counter Greater Than or Equal Compare Status bit" mask="0x00002000" name="PCHEQIRQ" values="QEI1STAT__PCHEQIRQ" />
         </register>
         <register caption="QEIx Status Register" name="QEI2STAT" offset="0x220" rw="RW" size="4">
            <bitfield caption="Index Input Event Interrupt Enable bit" mask="0x00000001" name="IDXIEN" values="QEI2STAT__IDXIEN" />
            <bitfield caption="Status Flag for Index Event Status bit" mask="0x00000002" name="IDXIRQ" values="QEI2STAT__IDXIRQ" />
            <bitfield caption="Home Input Event Interrupt Enable bit" mask="0x00000004" name="HOMIEN" values="QEI2STAT__HOMIEN" />
            <bitfield caption="Status Flag for Home Event Status bit" mask="0x00000008" name="HOMIRQ" values="QEI2STAT__HOMIRQ" />
            <bitfield caption="Velocity Counter Overflow Interrupt Enable bit" mask="0x00000010" name="VELOVIEN" values="QEI2STAT__VELOVIEN" />
            <bitfield caption="Velocity Counter Overflow Status bit" mask="0x00000020" name="VELOVIRQ" values="QEI2STAT__VELOVIRQ" />
            <bitfield caption="Position Counter Initialization Process Complete Interrupt Enable bit" mask="0x00000040" name="PCIIEN" values="QEI2STAT__PCIIEN" />
            <bitfield caption="Position Counter Initialization Process Complete Status bit " mask="0x00000080" name="PCIIRQ" values="QEI2STAT__PCIIRQ" />
            <bitfield caption="Position Counter Overflow Interrupt Enable bit" mask="0x00000100" name="POSOVIEN" values="QEI2STAT__POSOVIEN" />
            <bitfield caption="Position Counter Overflow Status bit" mask="0x00000200" name="POSOVIRQ" values="QEI2STAT__POSOVIRQ" />
            <bitfield caption="Position Counter Less Than or Equal Compare Interrupt Enable bit" mask="0x00000400" name="PCLEQIEN" values="QEI2STAT__PCLEQIEN" />
            <bitfield caption="Position Counter Less Than or Equal Compare Status bit" mask="0x00000800" name="PCLEQIRQ" values="QEI2STAT__PCLEQIRQ" />
            <bitfield caption="Position Counter Greater Than or Equal Compare Interrupt Enable bit" mask="0x00001000" name="PCHEQIEN" values="QEI2STAT__PCHEQIEN" />
            <bitfield caption="Position Counter Greater Than or Equal Compare Status bit" mask="0x00002000" name="PCHEQIRQ" values="QEI2STAT__PCHEQIRQ" />
         </register>
         <register caption="QEIx Status Register" name="QEI3STAT" offset="0x420" rw="RW" size="4">
            <bitfield caption="Index Input Event Interrupt Enable bit" mask="0x00000001" name="IDXIEN" values="QEI3STAT__IDXIEN" />
            <bitfield caption="Status Flag for Index Event Status bit" mask="0x00000002" name="IDXIRQ" values="QEI3STAT__IDXIRQ" />
            <bitfield caption="Home Input Event Interrupt Enable bit" mask="0x00000004" name="HOMIEN" values="QEI3STAT__HOMIEN" />
            <bitfield caption="Status Flag for Home Event Status bit" mask="0x00000008" name="HOMIRQ" values="QEI3STAT__HOMIRQ" />
            <bitfield caption="Velocity Counter Overflow Interrupt Enable bit" mask="0x00000010" name="VELOVIEN" values="QEI3STAT__VELOVIEN" />
            <bitfield caption="Velocity Counter Overflow Status bit" mask="0x00000020" name="VELOVIRQ" values="QEI3STAT__VELOVIRQ" />
            <bitfield caption="Position Counter Initialization Process Complete Interrupt Enable bit" mask="0x00000040" name="PCIIEN" values="QEI3STAT__PCIIEN" />
            <bitfield caption="Position Counter Initialization Process Complete Status bit " mask="0x00000080" name="PCIIRQ" values="QEI3STAT__PCIIRQ" />
            <bitfield caption="Position Counter Overflow Interrupt Enable bit" mask="0x00000100" name="POSOVIEN" values="QEI3STAT__POSOVIEN" />
            <bitfield caption="Position Counter Overflow Status bit" mask="0x00000200" name="POSOVIRQ" values="QEI3STAT__POSOVIRQ" />
            <bitfield caption="Position Counter Less Than or Equal Compare Interrupt Enable bit" mask="0x00000400" name="PCLEQIEN" values="QEI3STAT__PCLEQIEN" />
            <bitfield caption="Position Counter Less Than or Equal Compare Status bit" mask="0x00000800" name="PCLEQIRQ" values="QEI3STAT__PCLEQIRQ" />
            <bitfield caption="Position Counter Greater Than or Equal Compare Interrupt Enable bit" mask="0x00001000" name="PCHEQIEN" values="QEI3STAT__PCHEQIEN" />
            <bitfield caption="Position Counter Greater Than or Equal Compare Status bit" mask="0x00002000" name="PCHEQIRQ" values="QEI3STAT__PCHEQIRQ" />
         </register>
         <register caption="QEIx Status Register" name="QEI4STAT" offset="0x620" rw="RW" size="4">
            <bitfield caption="Index Input Event Interrupt Enable bit" mask="0x00000001" name="IDXIEN" values="QEI4STAT__IDXIEN" />
            <bitfield caption="Status Flag for Index Event Status bit" mask="0x00000002" name="IDXIRQ" values="QEI4STAT__IDXIRQ" />
            <bitfield caption="Home Input Event Interrupt Enable bit" mask="0x00000004" name="HOMIEN" values="QEI4STAT__HOMIEN" />
            <bitfield caption="Status Flag for Home Event Status bit" mask="0x00000008" name="HOMIRQ" values="QEI4STAT__HOMIRQ" />
            <bitfield caption="Velocity Counter Overflow Interrupt Enable bit" mask="0x00000010" name="VELOVIEN" values="QEI4STAT__VELOVIEN" />
            <bitfield caption="Velocity Counter Overflow Status bit" mask="0x00000020" name="VELOVIRQ" values="QEI4STAT__VELOVIRQ" />
            <bitfield caption="Position Counter Initialization Process Complete Interrupt Enable bit" mask="0x00000040" name="PCIIEN" values="QEI4STAT__PCIIEN" />
            <bitfield caption="Position Counter Initialization Process Complete Status bit " mask="0x00000080" name="PCIIRQ" values="QEI4STAT__PCIIRQ" />
            <bitfield caption="Position Counter Overflow Interrupt Enable bit" mask="0x00000100" name="POSOVIEN" values="QEI4STAT__POSOVIEN" />
            <bitfield caption="Position Counter Overflow Status bit" mask="0x00000200" name="POSOVIRQ" values="QEI4STAT__POSOVIRQ" />
            <bitfield caption="Position Counter Less Than or Equal Compare Interrupt Enable bit" mask="0x00000400" name="PCLEQIEN" values="QEI4STAT__PCLEQIEN" />
            <bitfield caption="Position Counter Less Than or Equal Compare Status bit" mask="0x00000800" name="PCLEQIRQ" values="QEI4STAT__PCLEQIRQ" />
            <bitfield caption="Position Counter Greater Than or Equal Compare Interrupt Enable bit" mask="0x00001000" name="PCHEQIEN" values="QEI4STAT__PCHEQIEN" />
            <bitfield caption="Position Counter Greater Than or Equal Compare Status bit" mask="0x00002000" name="PCHEQIRQ" values="QEI4STAT__PCHEQIRQ" />
         </register>
