Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024MCF100.atdf
         <register caption="Capture Low Register" name="QEI1CMPL" offset="0xc0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="QEICMPL" />
         </register>
         <register caption="Capture Low Register" name="QEI2CMPL" offset="0x2c0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="QEICMPL" />
         </register>
         <register caption="Capture Low Register" name="QEI3CMPL" offset="0x4c0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="QEICMPL" />
         </register>
         <register caption="Capture Low Register" name="QEI4CMPL" offset="0x6c0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="QEICMPL" />
         </register>
         <register caption="Capture Low Register" name="QEI5CMPL" offset="0x8c0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="QEICMPL" />
         </register>
         <register caption="Capture Low Register" name="QEI6CMPL" offset="0xac0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="QEICMPL" />
         </register>
      </register-group>
      <value-group caption="Counter Control Mode Selection bits" name="QEI1CON__CCM">
         <value caption="Internal Timer mode with optional QEB external clock gating input control based on GATEN. QEB High is Timer Run" name="" value="0x3" />
         <value caption="QEA is the external clock input" name="" value="0x2" />
         <value caption="QEA is the external clock input" name="" value="0x1" />
         <value caption="Quadrature Encoder Interface Count mode (x4 mode)" name="" value="0x0" />
      </value-group>
      <value-group caption="External Count Gate Enable bit" name="QEI1CON__GATEN">
         <value caption="External gate signal controls position counter operation" name="" value="0x1" />
         <value caption="External gate signal does not affect position counter/timer operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Position and Index Counter/Timer Direction Select bit" name="QEI1CON__CNTPOL">
         <value caption="Counter direction is negative unless modified by external Up/Down signal" name="" value="0x1" />
         <value caption="Counter direction is positive unless modified by external Up/Down signal" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer Input Clock Prescale Select bits " name="QEI1CON__INTDIV">
         <value caption="1:128 prescale value" name="" value="0x7" />
         <value caption="1:64 prescale value" name="" value="0x6" />
         <value caption="1:32 prescale value" name="" value="0x5" />
         <value caption="1:16 prescale value" name="" value="0x4" />
         <value caption="1:8 prescale value" name="" value="0x3" />
         <value caption="1:4 prescale value" name="" value="0x2" />
         <value caption="1:2 prescale value" name="" value="0x1" />
         <value caption="1:1 prescale value" name="" value="0x0" />
      </value-group>
      <value-group caption="Index Match Value bits" name="QEI1CON__IMV">
         <value caption="Index match occurs when QEB is 1 and QEA is 1" name="" value="0x3" />
         <value caption="Index match occurs when QEB is 1 and QEA is 0" name="" value="0x2" />
         <value caption="Index match occurs when QEB is 0 and QEA is 1" name="" value="0x1" />
         <value caption="Index match occurs when QEB is 0 and QEA is 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Initialization Mode Select bits" name="QEI1CON__PIMOD">
         <value caption="Modulo Count mode for position counter and every index event resets the position counter" name="" value="0x7" />
         <value caption="Modulo Count mode for position counter" name="" value="0x6" />
         <value caption="Resets the position counter when the position counter equals QEIxICCH register" name="" value="0x5" />
         <value caption="Second index event after home event initializes position counter with contents of QEIxICCHregister" name="" value="0x4" />
         <value caption="First index event after home event initializes position counter with contents of QEIxICCH register" name="" value="0x3" />
         <value caption="Next index input event initializes the position counter with contents of QEIxICCH register" name="" value="0x2" />
         <value caption="Every Index input event resets the position counter" name="" value="0x1" />
         <value caption="Index input event does not affect position counter" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="QEI1CON__QEISIDL">
         <value caption="Discontinue module operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue module operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Quadrature Encoder Interface Module Counter Enable bit" name="QEI1CON__QEIEN">
         <value caption="Module counters are enabled" name="" value="0x1" />
         <value caption="Module counters are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Counter Control Mode Selection bits" name="QEI2CON__CCM">
         <value caption="Internal Timer mode with optional QEB external clock gating input control based on GATEN. QEB High is Timer Run" name="" value="0x3" />
         <value caption="QEA is the external clock input" name="" value="0x2" />
         <value caption="QEA is the external clock input" name="" value="0x1" />
         <value caption="Quadrature Encoder Interface Count mode (x4 mode)" name="" value="0x0" />
      </value-group>
      <value-group caption="External Count Gate Enable bit" name="QEI2CON__GATEN">
         <value caption="External gate signal controls position counter operation" name="" value="0x1" />
         <value caption="External gate signal does not affect position counter/timer operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Position and Index Counter/Timer Direction Select bit" name="QEI2CON__CNTPOL">
         <value caption="Counter direction is negative unless modified by external Up/Down signal" name="" value="0x1" />
         <value caption="Counter direction is positive unless modified by external Up/Down signal" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer Input Clock Prescale Select bits " name="QEI2CON__INTDIV">
         <value caption="1:128 prescale value" name="" value="0x7" />
         <value caption="1:64 prescale value" name="" value="0x6" />
         <value caption="1:32 prescale value" name="" value="0x5" />
         <value caption="1:16 prescale value" name="" value="0x4" />
         <value caption="1:8 prescale value" name="" value="0x3" />
         <value caption="1:4 prescale value" name="" value="0x2" />
         <value caption="1:2 prescale value" name="" value="0x1" />
         <value caption="1:1 prescale value" name="" value="0x0" />
      </value-group>
      <value-group caption="Index Match Value bits" name="QEI2CON__IMV">
         <value caption="Index match occurs when QEB is 1 and QEA is 1" name="" value="0x3" />
         <value caption="Index match occurs when QEB is 1 and QEA is 0" name="" value="0x2" />
         <value caption="Index match occurs when QEB is 0 and QEA is 1" name="" value="0x1" />
         <value caption="Index match occurs when QEB is 0 and QEA is 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Initialization Mode Select bits" name="QEI2CON__PIMOD">
         <value caption="Modulo Count mode for position counter and every index event resets the position counter" name="" value="0x7" />
         <value caption="Modulo Count mode for position counter" name="" value="0x6" />
         <value caption="Resets the position counter when the position counter equals QEIxICCH register" name="" value="0x5" />
         <value caption="Second index event after home event initializes position counter with contents of QEIxICCHregister" name="" value="0x4" />
         <value caption="First index event after home event initializes position counter with contents of QEIxICCH register" name="" value="0x3" />
         <value caption="Next index input event initializes the position counter with contents of QEIxICCH register" name="" value="0x2" />
         <value caption="Every Index input event resets the position counter" name="" value="0x1" />
         <value caption="Index input event does not affect position counter" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="QEI2CON__QEISIDL">
         <value caption="Discontinue module operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue module operation in Idle mode" name="" value="0x0" />
      </value-group>
