Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024MCF100.atdf
      <value-group caption="Region Size bits" name="SBT1REG5__SIZE">
         <value caption="Region is not present" name="" value="0x0" />
         <value caption="Region is 1024 bytes" name="" value="0x1" />
         <value caption="Region is 2048 bytes" name="" value="0x2" />
         <value caption="Region is 4096 bytes" name="" value="0x3" />
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT1REG5__PRI">
         <value caption="Level 2" name="" value="0x1" />
         <value caption="Level 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Region Size bits" name="SBT1REG6__SIZE">
         <value caption="Region is not present" name="" value="0x0" />
         <value caption="Region is 1024 bytes" name="" value="0x1" />
         <value caption="Region is 2048 bytes" name="" value="0x2" />
         <value caption="Region is 4096 bytes" name="" value="0x3" />
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT1REG6__PRI">
         <value caption="Level 2" name="" value="0x1" />
         <value caption="Level 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Region Size bits" name="SBT1REG7__SIZE">
         <value caption="Region is not present" name="" value="0x0" />
         <value caption="Region is 1024 bytes" name="" value="0x1" />
         <value caption="Region is 2048 bytes" name="" value="0x2" />
         <value caption="Region is 4096 bytes" name="" value="0x3" />
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT1REG7__PRI">
         <value caption="Level 2" name="" value="0x1" />
         <value caption="Level 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Region Size bits" name="SBT1REG8__SIZE">
         <value caption="Region is not present" name="" value="0x0" />
         <value caption="Region is 1024 bytes" name="" value="0x1" />
         <value caption="Region is 2048 bytes" name="" value="0x2" />
         <value caption="Region is 4096 bytes" name="" value="0x3" />
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT1REG8__PRI">
         <value caption="Level 2" name="" value="0x1" />
         <value caption="Level 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Region Size bits" name="SBT2REG0__SIZE">
         <value caption="Region is not present" name="" value="0x0" />
         <value caption="Region is 1024 bytes" name="" value="0x1" />
         <value caption="Region is 2048 bytes" name="" value="0x2" />
         <value caption="Region is 4096 bytes" name="" value="0x3" />
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT2REG0__PRI">
         <value caption="Level 2" name="" value="0x1" />
         <value caption="Level 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Region Size bits" name="SBT2REG1__SIZE">
         <value caption="Region is not present" name="" value="0x0" />
         <value caption="Region is 1024 bytes" name="" value="0x1" />
         <value caption="Region is 2048 bytes" name="" value="0x2" />
         <value caption="Region is 4096 bytes" name="" value="0x3" />
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT2REG1__PRI">
         <value caption="Level 2" name="" value="0x1" />
         <value caption="Level 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Region Size bits" name="SBT2REG2__SIZE">
         <value caption="Region is not present" name="" value="0x0" />
         <value caption="Region is 1024 bytes" name="" value="0x1" />
         <value caption="Region is 2048 bytes" name="" value="0x2" />
         <value caption="Region is 4096 bytes" name="" value="0x3" />
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT2REG2__PRI">
         <value caption="Level 2" name="" value="0x1" />
         <value caption="Level 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Region Size bits" name="SBT3REG0__SIZE">
         <value caption="Region is not present" name="" value="0x0" />
         <value caption="Region is 1024 bytes" name="" value="0x1" />
         <value caption="Region is 2048 bytes" name="" value="0x2" />
         <value caption="Region is 4096 bytes" name="" value="0x3" />
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT3REG0__PRI">
         <value caption="Level 2" name="" value="0x1" />
         <value caption="Level 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Region Size bits" name="SBT3REG1__SIZE">
         <value caption="Region is not present" name="" value="0x0" />
         <value caption="Region is 1024 bytes" name="" value="0x1" />
         <value caption="Region is 2048 bytes" name="" value="0x2" />
         <value caption="Region is 4096 bytes" name="" value="0x3" />
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT3REG1__PRI">
         <value caption="Level 2" name="" value="0x1" />
         <value caption="Level 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Region Size bits" name="SBT3REG2__SIZE">
         <value caption="Region is not present" name="" value="0x0" />
         <value caption="Region is 1024 bytes" name="" value="0x1" />
         <value caption="Region is 2048 bytes" name="" value="0x2" />
         <value caption="Region is 4096 bytes" name="" value="0x3" />
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT3REG2__PRI">
         <value caption="Level 2" name="" value="0x1" />
         <value caption="Level 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Group0 Read Permissions bits" name="SBT0RD0__GROUP0">
         <value caption="Privilege Group 0 has read permission" name="" value="0x1" />
         <value caption="Privilege Group 0 does not have read permission" name="" value="0x0" />
      </value-group>
