Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024MCF100.atdf
         <register caption="Timer" name="TMR4" offset="0x610" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="TMR4" />
         </register>
         <register caption="Timer" name="TMR5" offset="0x810" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="TMR5" />
         </register>
         <register caption="Timer" name="TMR6" offset="0xa10" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="TMR6" />
         </register>
         <register caption="Timer" name="TMR7" offset="0xc10" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="TMR7" />
         </register>
         <register caption="Timer" name="TMR8" offset="0xe10" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="TMR8" />
         </register>
         <register caption="Timer" name="TMR9" offset="0x1010" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="TMR9" />
         </register>
         <register caption="Timer Period" name="PR2" offset="0x220" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="PR2" />
         </register>
         <register caption="Timer Period" name="PR3" offset="0x420" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="PR3" />
         </register>
         <register caption="Timer Period" name="PR4" offset="0x620" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="PR4" />
         </register>
         <register caption="Timer Period" name="PR5" offset="0x820" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="PR5" />
         </register>
         <register caption="Timer Period" name="PR6" offset="0xa20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="PR6" />
         </register>
         <register caption="Timer Period" name="PR7" offset="0xc20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="PR7" />
         </register>
         <register caption="Timer Period" name="PR8" offset="0xe20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="PR8" />
         </register>
         <register caption="Timer Period" name="PR9" offset="0x1020" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="PR9" />
         </register>
      </register-group>
      <value-group caption="Timer Clock Source Select bit" name="T2CON__TCS">
         <value caption="External clock from TxCK pin" name="EXT_CLK" value="0x1" />
         <value caption="Internal peripheral clock" name="INT_CLK" value="0x0" />
      </value-group>
      <value-group caption="32-Bit Timer Mode Select bit" name="T2CON__T32">
         <value caption="32-bit Timer mode" name="32_BIT" value="0x1" />
         <value caption="16-bit Timer mode" name="16_BIT" value="0x0" />
      </value-group>
      <value-group caption="Timer Input Clock Prescale Select bits" name="T2CON__TCKPS">
         <value caption="1:256 prescale value" name="DIV_256" value="0x7" />
         <value caption="1:64 prescale value" name="DIV_64" value="0x6" />
         <value caption="1:32 prescale value" name="DIV_32" value="0x5" />
         <value caption="1:16 prescale value" name="DIV_16" value="0x4" />
         <value caption="1:8 prescale value" name="DIV_8" value="0x3" />
         <value caption="1:4 prescale value" name="DIV_4" value="0x2" />
         <value caption="1:2 prescale value" name="DIV_2" value="0x1" />
         <value caption="1:1 prescale value" name="DIV_1" value="0x0" />
      </value-group>
      <value-group caption="Timer Gated Time Accumulation Enable bit" name="T2CON__TGATE">
         <value caption="Gated time accumulation is enabled" name="ENABLED" value="0x1" />
         <value caption="Gated time accumulation is disabled" name="DISABLED" value="0x0" />
      </value-group>
      <value-group caption="Synchronized Timer Start/Stop Enable bit" name="T2CON__SYNC">
         <value caption="Synchronized timer Start/Stop is enabled" name="ENABLED" value="0x1" />
         <value caption="Synchronized timer Start/Stop is disabled" name="DISABLED" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="T2CON__SIDL">
         <value caption="Discontinue operation when device enters Idle mode" name="STOP" value="0x1" />
         <value caption="Continue operation even in Idle mode" name="CONTINUE" value="0x0" />
      </value-group>
      <value-group caption="Timer On bit" name="T2CON__ON">
         <value caption="Module is enabled" name="ON" value="0x1" />
         <value caption="Module is disabled" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="Timer Clock Source Select bit" name="T3CON__TCS">
         <value caption="External clock from TxCK pin" name="EXT_CLK" value="0x1" />
         <value caption="Internal peripheral clock" name="INT_CLK" value="0x0" />
      </value-group>
      <value-group caption="32-Bit Timer Mode Select bit" name="T3CON__T32">
         <value caption="32-bit Timer mode" name="32_BIT" value="0x1" />
         <value caption="16-bit Timer mode" name="16_BIT" value="0x0" />
      </value-group>
      <value-group caption="Timer Input Clock Prescale Select bits" name="T3CON__TCKPS">
         <value caption="1:256 prescale value" name="DIV_256" value="0x7" />
         <value caption="1:64 prescale value" name="DIV_64" value="0x6" />
         <value caption="1:32 prescale value" name="DIV_32" value="0x5" />
         <value caption="1:16 prescale value" name="DIV_16" value="0x4" />
         <value caption="1:8 prescale value" name="DIV_8" value="0x3" />
         <value caption="1:4 prescale value" name="DIV_4" value="0x2" />
         <value caption="1:2 prescale value" name="DIV_2" value="0x1" />
         <value caption="1:1 prescale value" name="DIV_1" value="0x0" />
      </value-group>
      <value-group caption="Timer Gated Time Accumulation Enable bit" name="T3CON__TGATE">
         <value caption="Gated time accumulation is enabled" name="ENABLED" value="0x1" />
         <value caption="Gated time accumulation is disabled" name="DISABLED" value="0x0" />
      </value-group>
