Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024MCF100.atdf
      <value-group caption="Vbus Discharge Enable bit" name="U1OTGCON__VBUSDIS">
         <value caption="Vbus line is discharged through a pull-down resistor" name="" value="0x1" />
         <value caption="Vbus line is not discharged through a resistor" name="" value="0x0" />
      </value-group>
      <value-group caption="Vbus Charge Enable bit" name="U1OTGCON__VBUSCHG">
         <value caption="Vbus line is charged through a pull-up resistor" name="" value="0x1" />
         <value caption="Vbus line is not charged through a resistor" name="" value="0x0" />
      </value-group>
      <value-group caption="OTG Functionality Enable bit" name="U1OTGCON__OTGEN">
         <value caption="DPPULUP" name="" value="0x1" />
         <value caption="DPPULUP" name="" value="0x0" />
      </value-group>
      <value-group caption="Vbus Power-on bit" name="U1OTGCON__VBUSON">
         <value caption="Vbus line is powered" name="" value="0x1" />
         <value caption="Vbus line is not powered" name="" value="0x0" />
      </value-group>
      <value-group caption="D- Pull-Down Enable bit" name="U1OTGCON__DMPULDWN">
         <value caption="D- data line pull-down resistor is enabled" name="" value="0x1" />
         <value caption="D- data line pull-down resistor is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="D+ Pull-Down Enable bit" name="U1OTGCON__DPPULDWN">
         <value caption="D+ data line pull-down resistor is enabled" name="" value="0x1" />
         <value caption="D+ data line pull-down resistor is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="D- Pull-Up Enable bit" name="U1OTGCON__DMPULUP">
         <value caption="D- data line pull-up resistor is enabled" name="" value="0x1" />
         <value caption="D- data line pull-up resistor is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="D+ Pull-Up Enable bit" name="U1OTGCON__DPPULUP">
         <value caption="D+ data line pull-up resistor is enabled" name="" value="0x1" />
         <value caption="D+ data line pull-up resistor is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Vbus Discharge Enable bit" name="U2OTGCON__VBUSDIS">
         <value caption="Vbus line is discharged through a pull-down resistor" name="" value="0x1" />
         <value caption="Vbus line is not discharged through a resistor" name="" value="0x0" />
      </value-group>
      <value-group caption="Vbus Charge Enable bit" name="U2OTGCON__VBUSCHG">
         <value caption="Vbus line is charged through a pull-up resistor" name="" value="0x1" />
         <value caption="Vbus line is not charged through a resistor" name="" value="0x0" />
      </value-group>
      <value-group caption="OTG Functionality Enable bit" name="U2OTGCON__OTGEN">
         <value caption="DPPULUP" name="" value="0x1" />
         <value caption="DPPULUP" name="" value="0x0" />
      </value-group>
      <value-group caption="Vbus Power-on bit" name="U2OTGCON__VBUSON">
         <value caption="Vbus line is powered" name="" value="0x1" />
         <value caption="Vbus line is not powered" name="" value="0x0" />
      </value-group>
      <value-group caption="D- Pull-Down Enable bit" name="U2OTGCON__DMPULDWN">
         <value caption="D- data line pull-down resistor is enabled" name="" value="0x1" />
         <value caption="D- data line pull-down resistor is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="D+ Pull-Down Enable bit" name="U2OTGCON__DPPULDWN">
         <value caption="D+ data line pull-down resistor is enabled" name="" value="0x1" />
         <value caption="D+ data line pull-down resistor is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="D- Pull-Up Enable bit" name="U2OTGCON__DMPULUP">
         <value caption="D- data line pull-up resistor is enabled" name="" value="0x1" />
         <value caption="D- data line pull-up resistor is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="D+ Pull-Up Enable bit" name="U2OTGCON__DPPULUP">
         <value caption="D+ data line pull-up resistor is enabled" name="" value="0x1" />
         <value caption="D+ data line pull-up resistor is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="USB Operation Enable bit" name="U1PWRC__USBPWR">
         <value caption="USB module is turned on" name="" value="0x1" />
         <value caption="USB module is disabled (Outputs held inactive" name="" value="0x0" />
      </value-group>
      <value-group caption="USB Suspend Mode bit" name="U1PWRC__USUSPEND">
         <value caption="USB module is placed in Suspend mode (The 48 MHz USB clock will be gated off. The transceiver is placed in a low-power state.)" name="" value="0x1" />
         <value caption="USB module operates normally" name="" value="0x0" />
      </value-group>
      <value-group caption="USB Module Busy bit" name="U1PWRC__USBBUSY">
         <value caption="USB module is active or disabled" name="" value="0x1" />
         <value caption="USB module is not active and is ready to be enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="USB Sleep Entry Guard bit" name="U1PWRC__USLPGRD">
         <value caption="Sleep entry is blocked if USB bus activity is detected or if a notification is pending" name="" value="0x1" />
         <value caption="USB module does not block Sleep entry" name="" value="0x0" />
      </value-group>
      <value-group caption="USB Activity Pending bit" name="U1PWRC__UACTPND">
         <value caption="USB hardware has detected a change in link status; however" name="" value="0x1" />
         <value caption="An interrupt is not pending" name="" value="0x0" />
      </value-group>
      <value-group caption="USB Operation Enable bit" name="U2PWRC__USBPWR">
         <value caption="USB module is turned on" name="" value="0x1" />
         <value caption="USB module is disabled (Outputs held inactive" name="" value="0x0" />
      </value-group>
      <value-group caption="USB Suspend Mode bit" name="U2PWRC__USUSPEND">
         <value caption="USB module is placed in Suspend mode (The 48 MHz USB clock will be gated off. The transceiver is placed in a low-power state.)" name="" value="0x1" />
         <value caption="USB module operates normally" name="" value="0x0" />
      </value-group>
      <value-group caption="USB Module Busy bit" name="U2PWRC__USBBUSY">
         <value caption="USB module is active or disabled" name="" value="0x1" />
         <value caption="USB module is not active and is ready to be enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="USB Sleep Entry Guard bit" name="U2PWRC__USLPGRD">
         <value caption="Sleep entry is blocked if USB bus activity is detected or if a notification is pending" name="" value="0x1" />
         <value caption="USB module does not block Sleep entry" name="" value="0x0" />
      </value-group>
      <value-group caption="USB Activity Pending bit" name="U2PWRC__UACTPND">
         <value caption="USB hardware has detected a change in link status; however" name="" value="0x1" />
         <value caption="An interrupt is not pending" name="" value="0x0" />
      </value-group>
      <value-group caption="(Device mode) USB Reset Interrupt bit Device mode / (Host mode)USB Detach Interrupt bit Host mode" name="U1IR__URSTIF_DETACHIF">
         <value caption="(Device mode)Valid USB Reset has occurred / (Host mode)Peripheral detachment was detected by the USB module" name="" value="0x1" />
         <value caption="(Device mode)o USB Reset has occurred / (Host mode)Peripheral detachment was not detected" name="" value="0x0" />
      </value-group>
      <value-group caption="USB Error Condition Interrupt bit" name="U1IR__UERRIF">
         <value caption="Unmasked error condition has occurred" name="" value="0x1" />
         <value caption="Unmasked error condition has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="SOF Token Interrupt bit" name="U1IR__SOFIF">
         <value caption="SOF token received by the peripheral or the SOF threshold reached by the host" name="" value="0x1" />
         <value caption="SOF token was not received nor threshold reached" name="" value="0x0" />
      </value-group>
