Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024MCF100.atdf
      <value-group caption="Bidirectional Endpoint Control bit" name="U2EP2__EPCONDIS">
         <value caption="(If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint n from Control transfers; only TX and RX transfers allowed / (else)bit is ignored" name="" value="0x1" />
         <value caption="(If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint n for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Handshake Enable bit" name="U1EP3__EPHSHK">
         <value caption="Endpoint Handshake is enabled" name="" value="0x1" />
         <value caption="Endpoint Handshake is disabled (typically used for isochronous endpoints)" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Stall Status bit" name="U1EP3__EPSTALL">
         <value caption="Endpoint n was stalled" name="" value="0x1" />
         <value caption="Endpoint n was not stalled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Transmit Enable bit" name="U1EP3__EPTXEN">
         <value caption="Endpoint n transmit is enabled" name="" value="0x1" />
         <value caption="Endpoint n transmit is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Receive Enable bit" name="U1EP3__EPRXEN">
         <value caption="Endpoint n receive is enabled" name="" value="0x1" />
         <value caption="Endpoint n receive is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Bidirectional Endpoint Control bit" name="U1EP3__EPCONDIS">
         <value caption="(If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint n from Control transfers; only TX and RX transfers allowed / (else)bit is ignored" name="" value="0x1" />
         <value caption="(If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint n for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Handshake Enable bit" name="U2EP3__EPHSHK">
         <value caption="Endpoint Handshake is enabled" name="" value="0x1" />
         <value caption="Endpoint Handshake is disabled (typically used for isochronous endpoints)" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Stall Status bit" name="U2EP3__EPSTALL">
         <value caption="Endpoint n was stalled" name="" value="0x1" />
         <value caption="Endpoint n was not stalled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Transmit Enable bit" name="U2EP3__EPTXEN">
         <value caption="Endpoint n transmit is enabled" name="" value="0x1" />
         <value caption="Endpoint n transmit is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Receive Enable bit" name="U2EP3__EPRXEN">
         <value caption="Endpoint n receive is enabled" name="" value="0x1" />
         <value caption="Endpoint n receive is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Bidirectional Endpoint Control bit" name="U2EP3__EPCONDIS">
         <value caption="(If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint n from Control transfers; only TX and RX transfers allowed / (else)bit is ignored" name="" value="0x1" />
         <value caption="(If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint n for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Handshake Enable bit" name="U1EP4__EPHSHK">
         <value caption="Endpoint Handshake is enabled" name="" value="0x1" />
         <value caption="Endpoint Handshake is disabled (typically used for isochronous endpoints)" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Stall Status bit" name="U1EP4__EPSTALL">
         <value caption="Endpoint n was stalled" name="" value="0x1" />
         <value caption="Endpoint n was not stalled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Transmit Enable bit" name="U1EP4__EPTXEN">
         <value caption="Endpoint n transmit is enabled" name="" value="0x1" />
         <value caption="Endpoint n transmit is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Receive Enable bit" name="U1EP4__EPRXEN">
         <value caption="Endpoint n receive is enabled" name="" value="0x1" />
         <value caption="Endpoint n receive is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Bidirectional Endpoint Control bit" name="U1EP4__EPCONDIS">
         <value caption="(If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint n from Control transfers; only TX and RX transfers allowed / (else)bit is ignored" name="" value="0x1" />
         <value caption="(If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint n for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Handshake Enable bit" name="U2EP4__EPHSHK">
         <value caption="Endpoint Handshake is enabled" name="" value="0x1" />
         <value caption="Endpoint Handshake is disabled (typically used for isochronous endpoints)" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Stall Status bit" name="U2EP4__EPSTALL">
         <value caption="Endpoint n was stalled" name="" value="0x1" />
         <value caption="Endpoint n was not stalled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Transmit Enable bit" name="U2EP4__EPTXEN">
         <value caption="Endpoint n transmit is enabled" name="" value="0x1" />
         <value caption="Endpoint n transmit is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Receive Enable bit" name="U2EP4__EPRXEN">
         <value caption="Endpoint n receive is enabled" name="" value="0x1" />
         <value caption="Endpoint n receive is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Bidirectional Endpoint Control bit" name="U2EP4__EPCONDIS">
         <value caption="(If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint n from Control transfers; only TX and RX transfers allowed / (else)bit is ignored" name="" value="0x1" />
         <value caption="(If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint n for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored" name="" value="0x0" />
      </value-group>
